/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const LY_CTX_DISABLE_SEARCHDIRS: u32 = 8;
pub const LY_CTX_DISABLE_SEARCHDIR_CWD: u32 = 16;
pub const LY_CTX_PREFER_SEARCHDIRS: u32 = 32;
pub const LY_CTX_SET_PRIV_PARSED: u32 = 64;
pub const LY_CTX_EXPLICIT_COMPILE: u32 = 128;
pub const LY_CTX_ENABLE_IMP_FEATURES: u32 = 256;
pub const LY_CTX_COMPILE_OBSOLETE: u32 = 512;
pub const LY_CTX_LYB_HASHES: u32 = 1024;
pub const LY_CTX_LEAFREF_EXTENDED: u32 = 2048;
pub const LY_CTX_LEAFREF_LINKING: u32 = 4096;
pub const LY_CTX_BUILTIN_PLUGINS_ONLY: u32 = 8192;
pub const LY_CTX_STATIC_PLUGINS_ONLY: u32 = 16384;
pub const LYD_PARSE_ONLY: u32 = 65536;
pub const LYD_PARSE_STRICT: u32 = 131072;
pub const LYD_PARSE_OPAQ: u32 = 262144;
pub const LYD_PARSE_NO_STATE: u32 = 524288;
pub const LYD_PARSE_LYB_SKIP_MODULE_CHECK: u32 = 1048576;
pub const LYD_PARSE_ORDERED: u32 = 2097152;
pub const LYD_PARSE_WHEN_TRUE: u32 = 4194304;
pub const LYD_PARSE_NO_NEW: u32 = 8388608;
pub const LYD_PARSE_STORE_ONLY: u32 = 16842752;
pub const LYD_PARSE_JSON_NULL: u32 = 33554432;
pub const LYD_PARSE_JSON_STRING_DATATYPES: u32 = 67108864;
pub const LYD_PARSE_ANYDATA_STRICT: u32 = 134217728;
pub const LYD_PARSE_OPTS_MASK: u32 = 4294901760;
pub const LYD_VALIDATE_NO_STATE: u32 = 1;
pub const LYD_VALIDATE_PRESENT: u32 = 2;
pub const LYD_VALIDATE_MULTI_ERROR: u32 = 4;
pub const LYD_VALIDATE_OPERATIONAL: u32 = 8;
pub const LYD_VALIDATE_NO_DEFAULTS: u32 = 16;
pub const LYD_VALIDATE_NOT_FINAL: u32 = 32;
pub const LYD_VALIDATE_OPTS_MASK: u32 = 65535;
pub const LYPLG_EXT_API_VERSION: u32 = 12;
pub const LY_STMT_NODE_MASK: u32 = 65535;
pub const LYS_COMPILE_GROUPING: u32 = 1;
pub const LYS_COMPILE_DISABLED: u32 = 2;
pub const LYS_COMPILE_NO_CONFIG: u32 = 4;
pub const LYS_COMPILE_NO_DISABLED: u32 = 8;
pub const LYS_COMPILE_RPC_INPUT: u32 = 4100;
pub const LYS_COMPILE_RPC_OUTPUT: u32 = 8196;
pub const LYS_COMPILE_NOTIFICATION: u32 = 16388;
pub const LY_CTXP_MEM_ALIGN: u32 = 8;
pub const LY_PRINT_SHRINK: u32 = 2;
pub const LYD_PRINT_SIBLINGS: u32 = 1;
pub const LYD_PRINT_SHRINK: u32 = 2;
pub const LYD_PRINT_EMPTY_CONT: u32 = 4;
pub const LYD_PRINT_EMPTY_LEAF_LIST: u32 = 8;
pub const LYD_PRINT_WD_MASK: u32 = 240;
pub const LYD_PRINT_WD_EXPLICIT: u32 = 0;
pub const LYD_PRINT_WD_TRIM: u32 = 16;
pub const LYD_PRINT_WD_ALL: u32 = 32;
pub const LYD_PRINT_WD_ALL_TAG: u32 = 64;
pub const LYD_PRINT_WD_IMPL_TAG: u32 = 128;
pub const LYD_PRINT_JSON_NO_NESTED_PREFIX: u32 = 256;
pub const LYS_PRINT_SHRINK: u32 = 2;
pub const LYS_PRINT_NO_SUBSTMT: u32 = 16;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_off_t = __int64_t;
pub type in_addr_t = __uint32_t;
pub type time_t = __darwin_time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __u6_addr: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [__uint8_t; 16usize],
    pub __u6_addr16: [__uint16_t; 8usize],
    pub __u6_addr32: [__uint32_t; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__u6_addr"][::std::mem::offset_of!(in6_addr, __u6_addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_ctx {
    _unused: [u8; 0],
}
pub type ly_bool = u8;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_LOG_LEVEL {
    LY_LLERR = 0,
    LY_LLWRN = 1,
    LY_LLVRB = 2,
    LY_LLDBG = 3,
}
unsafe extern "C" {
    pub fn ly_log_level(level: LY_LOG_LEVEL) -> LY_LOG_LEVEL;
}
unsafe extern "C" {
    pub fn ly_log_options(opts: u32) -> u32;
}
unsafe extern "C" {
    pub fn ly_temp_log_options(opts: *mut u32) -> *mut u32;
}
unsafe extern "C" {
    pub fn ly_log_dbg_groups(dbg_groups: u32) -> u32;
}
pub type ly_log_clb = ::std::option::Option<
    unsafe extern "C" fn(
        level: LY_LOG_LEVEL,
        msg: *const ::std::os::raw::c_char,
        data_path: *const ::std::os::raw::c_char,
        schema_path: *const ::std::os::raw::c_char,
        line: u64,
    ),
>;
unsafe extern "C" {
    pub fn ly_set_log_clb(clb: ly_log_clb);
}
unsafe extern "C" {
    pub fn ly_get_log_clb() -> ly_log_clb;
}
unsafe extern "C" {
    pub fn ly_temp_log_clb(clb: ly_log_clb) -> ly_log_clb;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_ERR {
    LY_SUCCESS = 0,
    LY_EMEM = 1,
    LY_ESYS = 2,
    LY_EINVAL = 3,
    LY_EEXIST = 4,
    LY_ENOTFOUND = 5,
    LY_EINT = 6,
    LY_EVALID = 7,
    LY_EDENIED = 8,
    LY_EINCOMPLETE = 9,
    LY_ERECOMPILE = 10,
    LY_ENOT = 11,
    LY_EOTHER = 12,
    LY_EPLUGIN = 128,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_VECODE {
    LYVE_SUCCESS = 0,
    LYVE_SYNTAX = 1,
    LYVE_SYNTAX_YANG = 2,
    LYVE_SYNTAX_YIN = 3,
    LYVE_REFERENCE = 4,
    LYVE_XPATH = 5,
    LYVE_SEMANTICS = 6,
    LYVE_SYNTAX_XML = 7,
    LYVE_SYNTAX_JSON = 8,
    LYVE_DATA = 9,
    LYVE_OTHER = 10,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_err_item {
    pub level: LY_LOG_LEVEL,
    pub err: LY_ERR,
    pub vecode: LY_VECODE,
    pub msg: *mut ::std::os::raw::c_char,
    pub data_path: *mut ::std::os::raw::c_char,
    pub schema_path: *mut ::std::os::raw::c_char,
    pub line: u64,
    pub apptag: *mut ::std::os::raw::c_char,
    pub next: *mut ly_err_item,
    pub prev: *mut ly_err_item,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ly_err_item"][::std::mem::size_of::<ly_err_item>() - 72usize];
    ["Alignment of ly_err_item"][::std::mem::align_of::<ly_err_item>() - 8usize];
    ["Offset of field: ly_err_item::level"][::std::mem::offset_of!(ly_err_item, level) - 0usize];
    ["Offset of field: ly_err_item::err"][::std::mem::offset_of!(ly_err_item, err) - 4usize];
    ["Offset of field: ly_err_item::vecode"][::std::mem::offset_of!(ly_err_item, vecode) - 8usize];
    ["Offset of field: ly_err_item::msg"][::std::mem::offset_of!(ly_err_item, msg) - 16usize];
    ["Offset of field: ly_err_item::data_path"]
        [::std::mem::offset_of!(ly_err_item, data_path) - 24usize];
    ["Offset of field: ly_err_item::schema_path"]
        [::std::mem::offset_of!(ly_err_item, schema_path) - 32usize];
    ["Offset of field: ly_err_item::line"][::std::mem::offset_of!(ly_err_item, line) - 40usize];
    ["Offset of field: ly_err_item::apptag"][::std::mem::offset_of!(ly_err_item, apptag) - 48usize];
    ["Offset of field: ly_err_item::next"][::std::mem::offset_of!(ly_err_item, next) - 56usize];
    ["Offset of field: ly_err_item::prev"][::std::mem::offset_of!(ly_err_item, prev) - 64usize];
};
unsafe extern "C" {
    pub fn ly_strerr(err: LY_ERR) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_strvecode(vecode: LY_VECODE) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_last_logmsg() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_err_first(ctx: *const ly_ctx) -> *const ly_err_item;
}
unsafe extern "C" {
    pub fn ly_err_last(ctx: *const ly_ctx) -> *const ly_err_item;
}
unsafe extern "C" {
    pub fn ly_err_print(
        ctx: *const ly_ctx,
        eitem: *const ly_err_item,
        lnode: *const lyd_node,
        snode: *const lysc_node,
    );
}
unsafe extern "C" {
    pub fn ly_err_clean(ctx: *const ly_ctx, eitem: *mut ly_err_item);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_in {
    _unused: [u8; 0],
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LYS_INFORMAT {
    LYS_IN_UNKNOWN = 0,
    LYS_IN_YANG = 1,
    LYS_IN_YIN = 3,
}
unsafe extern "C" {
    pub fn lys_parse(
        ctx: *mut ly_ctx,
        in_: *mut ly_in,
        format: LYS_INFORMAT,
        features: *mut *const ::std::os::raw::c_char,
        module: *mut *mut lys_module,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_parse_mem(
        ctx: *mut ly_ctx,
        data: *const ::std::os::raw::c_char,
        format: LYS_INFORMAT,
        module: *mut *mut lys_module,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_parse_fd(
        ctx: *mut ly_ctx,
        fd: ::std::os::raw::c_int,
        format: LYS_INFORMAT,
        module: *mut *mut lys_module,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_parse_path(
        ctx: *mut ly_ctx,
        path: *const ::std::os::raw::c_char,
        format: LYS_INFORMAT,
        module: *mut *mut lys_module,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_search_localfile(
        searchpaths: *const *const ::std::os::raw::c_char,
        cwd: ly_bool,
        name: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
        localfile: *mut *mut ::std::os::raw::c_char,
        format: *mut LYS_INFORMAT,
    ) -> LY_ERR;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_DATA_TYPE {
    LY_TYPE_UNKNOWN = 0,
    LY_TYPE_BINARY = 1,
    LY_TYPE_UINT8 = 2,
    LY_TYPE_UINT16 = 3,
    LY_TYPE_UINT32 = 4,
    LY_TYPE_UINT64 = 5,
    LY_TYPE_STRING = 6,
    LY_TYPE_BITS = 7,
    LY_TYPE_BOOL = 8,
    LY_TYPE_DEC64 = 9,
    LY_TYPE_EMPTY = 10,
    LY_TYPE_ENUM = 11,
    LY_TYPE_IDENT = 12,
    LY_TYPE_INST = 13,
    LY_TYPE_LEAFREF = 14,
    LY_TYPE_UNION = 15,
    LY_TYPE_INT8 = 16,
    LY_TYPE_INT16 = 17,
    LY_TYPE_INT32 = 18,
    LY_TYPE_INT64 = 19,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_VALUE_FORMAT {
    LY_VALUE_CANON = 0,
    LY_VALUE_SCHEMA = 1,
    LY_VALUE_SCHEMA_RESOLVED = 2,
    LY_VALUE_XML = 3,
    LY_VALUE_JSON = 4,
    LY_VALUE_LYB = 5,
    LY_VALUE_STR_NS = 6,
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_path {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyxp_expr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_import {
    pub module: *mut lys_module,
    pub name: *const ::std::os::raw::c_char,
    pub prefix: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
    pub rev: [::std::os::raw::c_char; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_import"][::std::mem::size_of::<lysp_import>() - 64usize];
    ["Alignment of lysp_import"][::std::mem::align_of::<lysp_import>() - 8usize];
    ["Offset of field: lysp_import::module"][::std::mem::offset_of!(lysp_import, module) - 0usize];
    ["Offset of field: lysp_import::name"][::std::mem::offset_of!(lysp_import, name) - 8usize];
    ["Offset of field: lysp_import::prefix"][::std::mem::offset_of!(lysp_import, prefix) - 16usize];
    ["Offset of field: lysp_import::dsc"][::std::mem::offset_of!(lysp_import, dsc) - 24usize];
    ["Offset of field: lysp_import::ref_"][::std::mem::offset_of!(lysp_import, ref_) - 32usize];
    ["Offset of field: lysp_import::exts"][::std::mem::offset_of!(lysp_import, exts) - 40usize];
    ["Offset of field: lysp_import::flags"][::std::mem::offset_of!(lysp_import, flags) - 48usize];
    ["Offset of field: lysp_import::rev"][::std::mem::offset_of!(lysp_import, rev) - 50usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_include {
    pub submodule: *mut lysp_submodule,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub rev: [::std::os::raw::c_char; 11usize],
    pub injected: ly_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_include"][::std::mem::size_of::<lysp_include>() - 56usize];
    ["Alignment of lysp_include"][::std::mem::align_of::<lysp_include>() - 8usize];
    ["Offset of field: lysp_include::submodule"]
        [::std::mem::offset_of!(lysp_include, submodule) - 0usize];
    ["Offset of field: lysp_include::name"][::std::mem::offset_of!(lysp_include, name) - 8usize];
    ["Offset of field: lysp_include::dsc"][::std::mem::offset_of!(lysp_include, dsc) - 16usize];
    ["Offset of field: lysp_include::ref_"][::std::mem::offset_of!(lysp_include, ref_) - 24usize];
    ["Offset of field: lysp_include::exts"][::std::mem::offset_of!(lysp_include, exts) - 32usize];
    ["Offset of field: lysp_include::rev"][::std::mem::offset_of!(lysp_include, rev) - 40usize];
    ["Offset of field: lysp_include::injected"]
        [::std::mem::offset_of!(lysp_include, injected) - 51usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ext {
    pub name: *const ::std::os::raw::c_char,
    pub argname: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub plugin_ref: usize,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_ext"][::std::mem::size_of::<lysp_ext>() - 56usize];
    ["Alignment of lysp_ext"][::std::mem::align_of::<lysp_ext>() - 8usize];
    ["Offset of field: lysp_ext::name"][::std::mem::offset_of!(lysp_ext, name) - 0usize];
    ["Offset of field: lysp_ext::argname"][::std::mem::offset_of!(lysp_ext, argname) - 8usize];
    ["Offset of field: lysp_ext::dsc"][::std::mem::offset_of!(lysp_ext, dsc) - 16usize];
    ["Offset of field: lysp_ext::ref_"][::std::mem::offset_of!(lysp_ext, ref_) - 24usize];
    ["Offset of field: lysp_ext::exts"][::std::mem::offset_of!(lysp_ext, exts) - 32usize];
    ["Offset of field: lysp_ext::plugin_ref"]
        [::std::mem::offset_of!(lysp_ext, plugin_ref) - 40usize];
    ["Offset of field: lysp_ext::flags"][::std::mem::offset_of!(lysp_ext, flags) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_feature {
    pub name: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub iffeatures_c: *mut lysc_iffeature,
    pub depfeatures: *mut *mut lysp_feature,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_feature"][::std::mem::size_of::<lysp_feature>() - 64usize];
    ["Alignment of lysp_feature"][::std::mem::align_of::<lysp_feature>() - 8usize];
    ["Offset of field: lysp_feature::name"][::std::mem::offset_of!(lysp_feature, name) - 0usize];
    ["Offset of field: lysp_feature::iffeatures"]
        [::std::mem::offset_of!(lysp_feature, iffeatures) - 8usize];
    ["Offset of field: lysp_feature::iffeatures_c"]
        [::std::mem::offset_of!(lysp_feature, iffeatures_c) - 16usize];
    ["Offset of field: lysp_feature::depfeatures"]
        [::std::mem::offset_of!(lysp_feature, depfeatures) - 24usize];
    ["Offset of field: lysp_feature::dsc"][::std::mem::offset_of!(lysp_feature, dsc) - 32usize];
    ["Offset of field: lysp_feature::ref_"][::std::mem::offset_of!(lysp_feature, ref_) - 40usize];
    ["Offset of field: lysp_feature::exts"][::std::mem::offset_of!(lysp_feature, exts) - 48usize];
    ["Offset of field: lysp_feature::flags"][::std::mem::offset_of!(lysp_feature, flags) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_iffeature {
    pub expr: *mut u8,
    pub features: *mut *mut lysp_feature,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_iffeature"][::std::mem::size_of::<lysc_iffeature>() - 16usize];
    ["Alignment of lysc_iffeature"][::std::mem::align_of::<lysc_iffeature>() - 8usize];
    ["Offset of field: lysc_iffeature::expr"]
        [::std::mem::offset_of!(lysc_iffeature, expr) - 0usize];
    ["Offset of field: lysc_iffeature::features"]
        [::std::mem::offset_of!(lysc_iffeature, features) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_qname {
    pub str_: *const ::std::os::raw::c_char,
    pub mod_: *const lysp_module,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_qname"][::std::mem::size_of::<lysp_qname>() - 24usize];
    ["Alignment of lysp_qname"][::std::mem::align_of::<lysp_qname>() - 8usize];
    ["Offset of field: lysp_qname::str_"][::std::mem::offset_of!(lysp_qname, str_) - 0usize];
    ["Offset of field: lysp_qname::mod_"][::std::mem::offset_of!(lysp_qname, mod_) - 8usize];
    ["Offset of field: lysp_qname::flags"][::std::mem::offset_of!(lysp_qname, flags) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ident {
    pub name: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub bases: *mut *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_ident"][::std::mem::size_of::<lysp_ident>() - 56usize];
    ["Alignment of lysp_ident"][::std::mem::align_of::<lysp_ident>() - 8usize];
    ["Offset of field: lysp_ident::name"][::std::mem::offset_of!(lysp_ident, name) - 0usize];
    ["Offset of field: lysp_ident::iffeatures"]
        [::std::mem::offset_of!(lysp_ident, iffeatures) - 8usize];
    ["Offset of field: lysp_ident::bases"][::std::mem::offset_of!(lysp_ident, bases) - 16usize];
    ["Offset of field: lysp_ident::dsc"][::std::mem::offset_of!(lysp_ident, dsc) - 24usize];
    ["Offset of field: lysp_ident::ref_"][::std::mem::offset_of!(lysp_ident, ref_) - 32usize];
    ["Offset of field: lysp_ident::exts"][::std::mem::offset_of!(lysp_ident, exts) - 40usize];
    ["Offset of field: lysp_ident::flags"][::std::mem::offset_of!(lysp_ident, flags) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_restr {
    pub arg: lysp_qname,
    pub emsg: *const ::std::os::raw::c_char,
    pub eapptag: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_restr"][::std::mem::size_of::<lysp_restr>() - 64usize];
    ["Alignment of lysp_restr"][::std::mem::align_of::<lysp_restr>() - 8usize];
    ["Offset of field: lysp_restr::arg"][::std::mem::offset_of!(lysp_restr, arg) - 0usize];
    ["Offset of field: lysp_restr::emsg"][::std::mem::offset_of!(lysp_restr, emsg) - 24usize];
    ["Offset of field: lysp_restr::eapptag"][::std::mem::offset_of!(lysp_restr, eapptag) - 32usize];
    ["Offset of field: lysp_restr::dsc"][::std::mem::offset_of!(lysp_restr, dsc) - 40usize];
    ["Offset of field: lysp_restr::ref_"][::std::mem::offset_of!(lysp_restr, ref_) - 48usize];
    ["Offset of field: lysp_restr::exts"][::std::mem::offset_of!(lysp_restr, exts) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_revision {
    pub date: [::std::os::raw::c_char; 11usize],
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_revision"][::std::mem::size_of::<lysp_revision>() - 40usize];
    ["Alignment of lysp_revision"][::std::mem::align_of::<lysp_revision>() - 8usize];
    ["Offset of field: lysp_revision::date"][::std::mem::offset_of!(lysp_revision, date) - 0usize];
    ["Offset of field: lysp_revision::dsc"][::std::mem::offset_of!(lysp_revision, dsc) - 16usize];
    ["Offset of field: lysp_revision::ref_"][::std::mem::offset_of!(lysp_revision, ref_) - 24usize];
    ["Offset of field: lysp_revision::exts"][::std::mem::offset_of!(lysp_revision, exts) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_type_enum {
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub value: i64,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_type_enum"][::std::mem::size_of::<lysp_type_enum>() - 56usize];
    ["Alignment of lysp_type_enum"][::std::mem::align_of::<lysp_type_enum>() - 8usize];
    ["Offset of field: lysp_type_enum::name"]
        [::std::mem::offset_of!(lysp_type_enum, name) - 0usize];
    ["Offset of field: lysp_type_enum::dsc"][::std::mem::offset_of!(lysp_type_enum, dsc) - 8usize];
    ["Offset of field: lysp_type_enum::ref_"]
        [::std::mem::offset_of!(lysp_type_enum, ref_) - 16usize];
    ["Offset of field: lysp_type_enum::value"]
        [::std::mem::offset_of!(lysp_type_enum, value) - 24usize];
    ["Offset of field: lysp_type_enum::iffeatures"]
        [::std::mem::offset_of!(lysp_type_enum, iffeatures) - 32usize];
    ["Offset of field: lysp_type_enum::exts"]
        [::std::mem::offset_of!(lysp_type_enum, exts) - 40usize];
    ["Offset of field: lysp_type_enum::flags"]
        [::std::mem::offset_of!(lysp_type_enum, flags) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_type {
    pub name: *const ::std::os::raw::c_char,
    pub range: *mut lysp_restr,
    pub length: *mut lysp_restr,
    pub patterns: *mut lysp_restr,
    pub enums: *mut lysp_type_enum,
    pub bits: *mut lysp_type_enum,
    pub path: *mut lyxp_expr,
    pub bases: *mut *const ::std::os::raw::c_char,
    pub types: *mut lysp_type,
    pub exts: *mut lysp_ext_instance,
    pub pmod: *const lysp_module,
    pub compiled: *mut lysc_type,
    pub fraction_digits: u8,
    pub require_instance: u8,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_type"][::std::mem::size_of::<lysp_type>() - 104usize];
    ["Alignment of lysp_type"][::std::mem::align_of::<lysp_type>() - 8usize];
    ["Offset of field: lysp_type::name"][::std::mem::offset_of!(lysp_type, name) - 0usize];
    ["Offset of field: lysp_type::range"][::std::mem::offset_of!(lysp_type, range) - 8usize];
    ["Offset of field: lysp_type::length"][::std::mem::offset_of!(lysp_type, length) - 16usize];
    ["Offset of field: lysp_type::patterns"][::std::mem::offset_of!(lysp_type, patterns) - 24usize];
    ["Offset of field: lysp_type::enums"][::std::mem::offset_of!(lysp_type, enums) - 32usize];
    ["Offset of field: lysp_type::bits"][::std::mem::offset_of!(lysp_type, bits) - 40usize];
    ["Offset of field: lysp_type::path"][::std::mem::offset_of!(lysp_type, path) - 48usize];
    ["Offset of field: lysp_type::bases"][::std::mem::offset_of!(lysp_type, bases) - 56usize];
    ["Offset of field: lysp_type::types"][::std::mem::offset_of!(lysp_type, types) - 64usize];
    ["Offset of field: lysp_type::exts"][::std::mem::offset_of!(lysp_type, exts) - 72usize];
    ["Offset of field: lysp_type::pmod"][::std::mem::offset_of!(lysp_type, pmod) - 80usize];
    ["Offset of field: lysp_type::compiled"][::std::mem::offset_of!(lysp_type, compiled) - 88usize];
    ["Offset of field: lysp_type::fraction_digits"]
        [::std::mem::offset_of!(lysp_type, fraction_digits) - 96usize];
    ["Offset of field: lysp_type::require_instance"]
        [::std::mem::offset_of!(lysp_type, require_instance) - 97usize];
    ["Offset of field: lysp_type::flags"][::std::mem::offset_of!(lysp_type, flags) - 98usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_tpdf {
    pub name: *const ::std::os::raw::c_char,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysp_qname,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub type_: lysp_type,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_tpdf"][::std::mem::size_of::<lysp_tpdf>() - 176usize];
    ["Alignment of lysp_tpdf"][::std::mem::align_of::<lysp_tpdf>() - 8usize];
    ["Offset of field: lysp_tpdf::name"][::std::mem::offset_of!(lysp_tpdf, name) - 0usize];
    ["Offset of field: lysp_tpdf::units"][::std::mem::offset_of!(lysp_tpdf, units) - 8usize];
    ["Offset of field: lysp_tpdf::dflt"][::std::mem::offset_of!(lysp_tpdf, dflt) - 16usize];
    ["Offset of field: lysp_tpdf::dsc"][::std::mem::offset_of!(lysp_tpdf, dsc) - 40usize];
    ["Offset of field: lysp_tpdf::ref_"][::std::mem::offset_of!(lysp_tpdf, ref_) - 48usize];
    ["Offset of field: lysp_tpdf::exts"][::std::mem::offset_of!(lysp_tpdf, exts) - 56usize];
    ["Offset of field: lysp_tpdf::type_"][::std::mem::offset_of!(lysp_tpdf, type_) - 64usize];
    ["Offset of field: lysp_tpdf::flags"][::std::mem::offset_of!(lysp_tpdf, flags) - 168usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_when {
    pub cond: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_when"][::std::mem::size_of::<lysp_when>() - 32usize];
    ["Alignment of lysp_when"][::std::mem::align_of::<lysp_when>() - 8usize];
    ["Offset of field: lysp_when::cond"][::std::mem::offset_of!(lysp_when, cond) - 0usize];
    ["Offset of field: lysp_when::dsc"][::std::mem::offset_of!(lysp_when, dsc) - 8usize];
    ["Offset of field: lysp_when::ref_"][::std::mem::offset_of!(lysp_when, ref_) - 16usize];
    ["Offset of field: lysp_when::exts"][::std::mem::offset_of!(lysp_when, exts) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_refine {
    pub nodeid: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub musts: *mut lysp_restr,
    pub presence: *const ::std::os::raw::c_char,
    pub dflts: *mut lysp_qname,
    pub min: u32,
    pub max: u32,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_refine"][::std::mem::size_of::<lysp_refine>() - 80usize];
    ["Alignment of lysp_refine"][::std::mem::align_of::<lysp_refine>() - 8usize];
    ["Offset of field: lysp_refine::nodeid"][::std::mem::offset_of!(lysp_refine, nodeid) - 0usize];
    ["Offset of field: lysp_refine::dsc"][::std::mem::offset_of!(lysp_refine, dsc) - 8usize];
    ["Offset of field: lysp_refine::ref_"][::std::mem::offset_of!(lysp_refine, ref_) - 16usize];
    ["Offset of field: lysp_refine::iffeatures"]
        [::std::mem::offset_of!(lysp_refine, iffeatures) - 24usize];
    ["Offset of field: lysp_refine::musts"][::std::mem::offset_of!(lysp_refine, musts) - 32usize];
    ["Offset of field: lysp_refine::presence"]
        [::std::mem::offset_of!(lysp_refine, presence) - 40usize];
    ["Offset of field: lysp_refine::dflts"][::std::mem::offset_of!(lysp_refine, dflts) - 48usize];
    ["Offset of field: lysp_refine::min"][::std::mem::offset_of!(lysp_refine, min) - 56usize];
    ["Offset of field: lysp_refine::max"][::std::mem::offset_of!(lysp_refine, max) - 60usize];
    ["Offset of field: lysp_refine::exts"][::std::mem::offset_of!(lysp_refine, exts) - 64usize];
    ["Offset of field: lysp_refine::flags"][::std::mem::offset_of!(lysp_refine, flags) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate"][::std::mem::size_of::<lysp_deviate>() - 24usize];
    ["Alignment of lysp_deviate"][::std::mem::align_of::<lysp_deviate>() - 8usize];
    ["Offset of field: lysp_deviate::mod_"][::std::mem::offset_of!(lysp_deviate, mod_) - 0usize];
    ["Offset of field: lysp_deviate::next"][::std::mem::offset_of!(lysp_deviate, next) - 8usize];
    ["Offset of field: lysp_deviate::exts"][::std::mem::offset_of!(lysp_deviate, exts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate_add {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
    pub units: *const ::std::os::raw::c_char,
    pub musts: *mut lysp_restr,
    pub uniques: *mut lysp_qname,
    pub dflts: *mut lysp_qname,
    pub flags: u16,
    pub min: u32,
    pub max: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate_add"][::std::mem::size_of::<lysp_deviate_add>() - 72usize];
    ["Alignment of lysp_deviate_add"][::std::mem::align_of::<lysp_deviate_add>() - 8usize];
    ["Offset of field: lysp_deviate_add::mod_"]
        [::std::mem::offset_of!(lysp_deviate_add, mod_) - 0usize];
    ["Offset of field: lysp_deviate_add::next"]
        [::std::mem::offset_of!(lysp_deviate_add, next) - 8usize];
    ["Offset of field: lysp_deviate_add::exts"]
        [::std::mem::offset_of!(lysp_deviate_add, exts) - 16usize];
    ["Offset of field: lysp_deviate_add::units"]
        [::std::mem::offset_of!(lysp_deviate_add, units) - 24usize];
    ["Offset of field: lysp_deviate_add::musts"]
        [::std::mem::offset_of!(lysp_deviate_add, musts) - 32usize];
    ["Offset of field: lysp_deviate_add::uniques"]
        [::std::mem::offset_of!(lysp_deviate_add, uniques) - 40usize];
    ["Offset of field: lysp_deviate_add::dflts"]
        [::std::mem::offset_of!(lysp_deviate_add, dflts) - 48usize];
    ["Offset of field: lysp_deviate_add::flags"]
        [::std::mem::offset_of!(lysp_deviate_add, flags) - 56usize];
    ["Offset of field: lysp_deviate_add::min"]
        [::std::mem::offset_of!(lysp_deviate_add, min) - 60usize];
    ["Offset of field: lysp_deviate_add::max"]
        [::std::mem::offset_of!(lysp_deviate_add, max) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate_del {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
    pub units: *const ::std::os::raw::c_char,
    pub musts: *mut lysp_restr,
    pub uniques: *mut lysp_qname,
    pub dflts: *mut lysp_qname,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate_del"][::std::mem::size_of::<lysp_deviate_del>() - 56usize];
    ["Alignment of lysp_deviate_del"][::std::mem::align_of::<lysp_deviate_del>() - 8usize];
    ["Offset of field: lysp_deviate_del::mod_"]
        [::std::mem::offset_of!(lysp_deviate_del, mod_) - 0usize];
    ["Offset of field: lysp_deviate_del::next"]
        [::std::mem::offset_of!(lysp_deviate_del, next) - 8usize];
    ["Offset of field: lysp_deviate_del::exts"]
        [::std::mem::offset_of!(lysp_deviate_del, exts) - 16usize];
    ["Offset of field: lysp_deviate_del::units"]
        [::std::mem::offset_of!(lysp_deviate_del, units) - 24usize];
    ["Offset of field: lysp_deviate_del::musts"]
        [::std::mem::offset_of!(lysp_deviate_del, musts) - 32usize];
    ["Offset of field: lysp_deviate_del::uniques"]
        [::std::mem::offset_of!(lysp_deviate_del, uniques) - 40usize];
    ["Offset of field: lysp_deviate_del::dflts"]
        [::std::mem::offset_of!(lysp_deviate_del, dflts) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate_rpl {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
    pub type_: *mut lysp_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysp_qname,
    pub flags: u16,
    pub min: u32,
    pub max: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate_rpl"][::std::mem::size_of::<lysp_deviate_rpl>() - 80usize];
    ["Alignment of lysp_deviate_rpl"][::std::mem::align_of::<lysp_deviate_rpl>() - 8usize];
    ["Offset of field: lysp_deviate_rpl::mod_"]
        [::std::mem::offset_of!(lysp_deviate_rpl, mod_) - 0usize];
    ["Offset of field: lysp_deviate_rpl::next"]
        [::std::mem::offset_of!(lysp_deviate_rpl, next) - 8usize];
    ["Offset of field: lysp_deviate_rpl::exts"]
        [::std::mem::offset_of!(lysp_deviate_rpl, exts) - 16usize];
    ["Offset of field: lysp_deviate_rpl::type_"]
        [::std::mem::offset_of!(lysp_deviate_rpl, type_) - 24usize];
    ["Offset of field: lysp_deviate_rpl::units"]
        [::std::mem::offset_of!(lysp_deviate_rpl, units) - 32usize];
    ["Offset of field: lysp_deviate_rpl::dflt"]
        [::std::mem::offset_of!(lysp_deviate_rpl, dflt) - 40usize];
    ["Offset of field: lysp_deviate_rpl::flags"]
        [::std::mem::offset_of!(lysp_deviate_rpl, flags) - 64usize];
    ["Offset of field: lysp_deviate_rpl::min"]
        [::std::mem::offset_of!(lysp_deviate_rpl, min) - 68usize];
    ["Offset of field: lysp_deviate_rpl::max"]
        [::std::mem::offset_of!(lysp_deviate_rpl, max) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviation {
    pub nodeid: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub deviates: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviation"][::std::mem::size_of::<lysp_deviation>() - 40usize];
    ["Alignment of lysp_deviation"][::std::mem::align_of::<lysp_deviation>() - 8usize];
    ["Offset of field: lysp_deviation::nodeid"]
        [::std::mem::offset_of!(lysp_deviation, nodeid) - 0usize];
    ["Offset of field: lysp_deviation::dsc"][::std::mem::offset_of!(lysp_deviation, dsc) - 8usize];
    ["Offset of field: lysp_deviation::ref_"]
        [::std::mem::offset_of!(lysp_deviation, ref_) - 16usize];
    ["Offset of field: lysp_deviation::deviates"]
        [::std::mem::offset_of!(lysp_deviation, deviates) - 24usize];
    ["Offset of field: lysp_deviation::exts"]
        [::std::mem::offset_of!(lysp_deviation, exts) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node"][::std::mem::size_of::<lysp_node>() - 64usize];
    ["Alignment of lysp_node"][::std::mem::align_of::<lysp_node>() - 8usize];
    ["Offset of field: lysp_node::parent"][::std::mem::offset_of!(lysp_node, parent) - 0usize];
    ["Offset of field: lysp_node::nodetype"][::std::mem::offset_of!(lysp_node, nodetype) - 8usize];
    ["Offset of field: lysp_node::flags"][::std::mem::offset_of!(lysp_node, flags) - 10usize];
    ["Offset of field: lysp_node::next"][::std::mem::offset_of!(lysp_node, next) - 16usize];
    ["Offset of field: lysp_node::name"][::std::mem::offset_of!(lysp_node, name) - 24usize];
    ["Offset of field: lysp_node::dsc"][::std::mem::offset_of!(lysp_node, dsc) - 32usize];
    ["Offset of field: lysp_node::ref_"][::std::mem::offset_of!(lysp_node, ref_) - 40usize];
    ["Offset of field: lysp_node::iffeatures"]
        [::std::mem::offset_of!(lysp_node, iffeatures) - 48usize];
    ["Offset of field: lysp_node::exts"][::std::mem::offset_of!(lysp_node, exts) - 56usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_container {
    pub __bindgen_anon_1: lysp_node_container__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub presence: *const ::std::os::raw::c_char,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_container__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_container__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_container__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_container__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_container__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_container__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_container__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_container__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_container__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_container__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_container__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_container__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_container"][::std::mem::size_of::<lysp_node_container>() - 128usize];
    ["Alignment of lysp_node_container"][::std::mem::align_of::<lysp_node_container>() - 8usize];
    ["Offset of field: lysp_node_container::musts"]
        [::std::mem::offset_of!(lysp_node_container, musts) - 64usize];
    ["Offset of field: lysp_node_container::when"]
        [::std::mem::offset_of!(lysp_node_container, when) - 72usize];
    ["Offset of field: lysp_node_container::presence"]
        [::std::mem::offset_of!(lysp_node_container, presence) - 80usize];
    ["Offset of field: lysp_node_container::typedefs"]
        [::std::mem::offset_of!(lysp_node_container, typedefs) - 88usize];
    ["Offset of field: lysp_node_container::groupings"]
        [::std::mem::offset_of!(lysp_node_container, groupings) - 96usize];
    ["Offset of field: lysp_node_container::child"]
        [::std::mem::offset_of!(lysp_node_container, child) - 104usize];
    ["Offset of field: lysp_node_container::actions"]
        [::std::mem::offset_of!(lysp_node_container, actions) - 112usize];
    ["Offset of field: lysp_node_container::notifs"]
        [::std::mem::offset_of!(lysp_node_container, notifs) - 120usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_leaf {
    pub __bindgen_anon_1: lysp_node_leaf__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub type_: lysp_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysp_qname,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_leaf__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_leaf__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaf__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaf__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_leaf__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaf__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, iffeatures) - 48usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaf__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaf__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_leaf__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaf__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaf"][::std::mem::size_of::<lysp_node_leaf>() - 216usize];
    ["Alignment of lysp_node_leaf"][::std::mem::align_of::<lysp_node_leaf>() - 8usize];
    ["Offset of field: lysp_node_leaf::musts"]
        [::std::mem::offset_of!(lysp_node_leaf, musts) - 64usize];
    ["Offset of field: lysp_node_leaf::when"]
        [::std::mem::offset_of!(lysp_node_leaf, when) - 72usize];
    ["Offset of field: lysp_node_leaf::type_"]
        [::std::mem::offset_of!(lysp_node_leaf, type_) - 80usize];
    ["Offset of field: lysp_node_leaf::units"]
        [::std::mem::offset_of!(lysp_node_leaf, units) - 184usize];
    ["Offset of field: lysp_node_leaf::dflt"]
        [::std::mem::offset_of!(lysp_node_leaf, dflt) - 192usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_leaflist {
    pub __bindgen_anon_1: lysp_node_leaflist__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub type_: lysp_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflts: *mut lysp_qname,
    pub min: u32,
    pub max: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_leaflist__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaflist__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaflist__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_leaflist__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaflist__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_leaflist__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaflist"][::std::mem::size_of::<lysp_node_leaflist>() - 208usize];
    ["Alignment of lysp_node_leaflist"][::std::mem::align_of::<lysp_node_leaflist>() - 8usize];
    ["Offset of field: lysp_node_leaflist::musts"]
        [::std::mem::offset_of!(lysp_node_leaflist, musts) - 64usize];
    ["Offset of field: lysp_node_leaflist::when"]
        [::std::mem::offset_of!(lysp_node_leaflist, when) - 72usize];
    ["Offset of field: lysp_node_leaflist::type_"]
        [::std::mem::offset_of!(lysp_node_leaflist, type_) - 80usize];
    ["Offset of field: lysp_node_leaflist::units"]
        [::std::mem::offset_of!(lysp_node_leaflist, units) - 184usize];
    ["Offset of field: lysp_node_leaflist::dflts"]
        [::std::mem::offset_of!(lysp_node_leaflist, dflts) - 192usize];
    ["Offset of field: lysp_node_leaflist::min"]
        [::std::mem::offset_of!(lysp_node_leaflist, min) - 200usize];
    ["Offset of field: lysp_node_leaflist::max"]
        [::std::mem::offset_of!(lysp_node_leaflist, max) - 204usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_list {
    pub __bindgen_anon_1: lysp_node_list__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub key: *const ::std::os::raw::c_char,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
    pub uniques: *mut lysp_qname,
    pub min: u32,
    pub max: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_list__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_list__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_list__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_list__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_list__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_list__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_list__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, iffeatures) - 48usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_list__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_list__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_list__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_list__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_list"][::std::mem::size_of::<lysp_node_list>() - 144usize];
    ["Alignment of lysp_node_list"][::std::mem::align_of::<lysp_node_list>() - 8usize];
    ["Offset of field: lysp_node_list::musts"]
        [::std::mem::offset_of!(lysp_node_list, musts) - 64usize];
    ["Offset of field: lysp_node_list::when"]
        [::std::mem::offset_of!(lysp_node_list, when) - 72usize];
    ["Offset of field: lysp_node_list::key"][::std::mem::offset_of!(lysp_node_list, key) - 80usize];
    ["Offset of field: lysp_node_list::typedefs"]
        [::std::mem::offset_of!(lysp_node_list, typedefs) - 88usize];
    ["Offset of field: lysp_node_list::groupings"]
        [::std::mem::offset_of!(lysp_node_list, groupings) - 96usize];
    ["Offset of field: lysp_node_list::child"]
        [::std::mem::offset_of!(lysp_node_list, child) - 104usize];
    ["Offset of field: lysp_node_list::actions"]
        [::std::mem::offset_of!(lysp_node_list, actions) - 112usize];
    ["Offset of field: lysp_node_list::notifs"]
        [::std::mem::offset_of!(lysp_node_list, notifs) - 120usize];
    ["Offset of field: lysp_node_list::uniques"]
        [::std::mem::offset_of!(lysp_node_list, uniques) - 128usize];
    ["Offset of field: lysp_node_list::min"]
        [::std::mem::offset_of!(lysp_node_list, min) - 136usize];
    ["Offset of field: lysp_node_list::max"]
        [::std::mem::offset_of!(lysp_node_list, max) - 140usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_choice {
    pub __bindgen_anon_1: lysp_node_choice__bindgen_ty_1,
    pub child: *mut lysp_node,
    pub when: *mut lysp_when,
    pub dflt: lysp_qname,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_choice__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_choice__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_choice__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_choice__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_choice__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_choice__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_choice__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_choice__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_choice__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_choice__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_choice"][::std::mem::size_of::<lysp_node_choice>() - 104usize];
    ["Alignment of lysp_node_choice"][::std::mem::align_of::<lysp_node_choice>() - 8usize];
    ["Offset of field: lysp_node_choice::child"]
        [::std::mem::offset_of!(lysp_node_choice, child) - 64usize];
    ["Offset of field: lysp_node_choice::when"]
        [::std::mem::offset_of!(lysp_node_choice, when) - 72usize];
    ["Offset of field: lysp_node_choice::dflt"]
        [::std::mem::offset_of!(lysp_node_choice, dflt) - 80usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_case {
    pub __bindgen_anon_1: lysp_node_case__bindgen_ty_1,
    pub child: *mut lysp_node,
    pub when: *mut lysp_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_case__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_case__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_case__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_case__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_case__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_case__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_case__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, iffeatures) - 48usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_case__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_case__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_case__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_case__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_case"][::std::mem::size_of::<lysp_node_case>() - 80usize];
    ["Alignment of lysp_node_case"][::std::mem::align_of::<lysp_node_case>() - 8usize];
    ["Offset of field: lysp_node_case::child"]
        [::std::mem::offset_of!(lysp_node_case, child) - 64usize];
    ["Offset of field: lysp_node_case::when"]
        [::std::mem::offset_of!(lysp_node_case, when) - 72usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_anydata {
    pub __bindgen_anon_1: lysp_node_anydata__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_anydata__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_anydata__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_anydata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_anydata__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_anydata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_anydata__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_anydata__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_anydata__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_anydata__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_anydata__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_anydata__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_anydata"][::std::mem::size_of::<lysp_node_anydata>() - 80usize];
    ["Alignment of lysp_node_anydata"][::std::mem::align_of::<lysp_node_anydata>() - 8usize];
    ["Offset of field: lysp_node_anydata::musts"]
        [::std::mem::offset_of!(lysp_node_anydata, musts) - 64usize];
    ["Offset of field: lysp_node_anydata::when"]
        [::std::mem::offset_of!(lysp_node_anydata, when) - 72usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_uses {
    pub __bindgen_anon_1: lysp_node_uses__bindgen_ty_1,
    pub refines: *mut lysp_refine,
    pub augments: *mut lysp_node_augment,
    pub when: *mut lysp_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_uses__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_uses__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_uses__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_uses__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_uses__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_uses__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, iffeatures) - 48usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_uses__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_uses__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_uses__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_uses__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_uses"][::std::mem::size_of::<lysp_node_uses>() - 88usize];
    ["Alignment of lysp_node_uses"][::std::mem::align_of::<lysp_node_uses>() - 8usize];
    ["Offset of field: lysp_node_uses::refines"]
        [::std::mem::offset_of!(lysp_node_uses, refines) - 64usize];
    ["Offset of field: lysp_node_uses::augments"]
        [::std::mem::offset_of!(lysp_node_uses, augments) - 72usize];
    ["Offset of field: lysp_node_uses::when"]
        [::std::mem::offset_of!(lysp_node_uses, when) - 80usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_action_inout {
    pub __bindgen_anon_1: lysp_node_action_inout__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_action_inout__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        parent
    ) - 0usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        flags
    ) - 10usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        next
    ) - 16usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        name
    ) - 24usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        ref_
    ) - 40usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    )
        - 48usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        exts
    ) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action_inout__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_action_inout__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_action_inout__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_action_inout__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_action_inout__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action_inout"][::std::mem::size_of::<lysp_node_action_inout>() - 96usize];
    ["Alignment of lysp_node_action_inout"]
        [::std::mem::align_of::<lysp_node_action_inout>() - 8usize];
    ["Offset of field: lysp_node_action_inout::musts"]
        [::std::mem::offset_of!(lysp_node_action_inout, musts) - 64usize];
    ["Offset of field: lysp_node_action_inout::typedefs"]
        [::std::mem::offset_of!(lysp_node_action_inout, typedefs) - 72usize];
    ["Offset of field: lysp_node_action_inout::groupings"]
        [::std::mem::offset_of!(lysp_node_action_inout, groupings) - 80usize];
    ["Offset of field: lysp_node_action_inout::child"]
        [::std::mem::offset_of!(lysp_node_action_inout, child) - 88usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_action {
    pub __bindgen_anon_1: lysp_node_action__bindgen_ty_1,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub input: lysp_node_action_inout,
    pub output: lysp_node_action_inout,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_action__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_action__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_action__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_action,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_action__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_action__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_action__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_action__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_action__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_action__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action"][::std::mem::size_of::<lysp_node_action>() - 272usize];
    ["Alignment of lysp_node_action"][::std::mem::align_of::<lysp_node_action>() - 8usize];
    ["Offset of field: lysp_node_action::typedefs"]
        [::std::mem::offset_of!(lysp_node_action, typedefs) - 64usize];
    ["Offset of field: lysp_node_action::groupings"]
        [::std::mem::offset_of!(lysp_node_action, groupings) - 72usize];
    ["Offset of field: lysp_node_action::input"]
        [::std::mem::offset_of!(lysp_node_action, input) - 80usize];
    ["Offset of field: lysp_node_action::output"]
        [::std::mem::offset_of!(lysp_node_action, output) - 176usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_notif {
    pub __bindgen_anon_1: lysp_node_notif__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_notif__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_notif__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_notif,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_notif__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_notif__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_notif__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_notif__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, iffeatures) - 48usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_notif__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_notif__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_notif__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_notif__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_notif"][::std::mem::size_of::<lysp_node_notif>() - 96usize];
    ["Alignment of lysp_node_notif"][::std::mem::align_of::<lysp_node_notif>() - 8usize];
    ["Offset of field: lysp_node_notif::musts"]
        [::std::mem::offset_of!(lysp_node_notif, musts) - 64usize];
    ["Offset of field: lysp_node_notif::typedefs"]
        [::std::mem::offset_of!(lysp_node_notif, typedefs) - 72usize];
    ["Offset of field: lysp_node_notif::groupings"]
        [::std::mem::offset_of!(lysp_node_notif, groupings) - 80usize];
    ["Offset of field: lysp_node_notif::child"]
        [::std::mem::offset_of!(lysp_node_notif, child) - 88usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_grp {
    pub __bindgen_anon_1: lysp_node_grp__bindgen_ty_1,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_grp__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_grp__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_grp,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_grp__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_grp__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_grp__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_grp__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, name) - 24usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, iffeatures) - 48usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_grp__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_grp__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_grp__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_grp__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_grp"][::std::mem::size_of::<lysp_node_grp>() - 104usize];
    ["Alignment of lysp_node_grp"][::std::mem::align_of::<lysp_node_grp>() - 8usize];
    ["Offset of field: lysp_node_grp::typedefs"]
        [::std::mem::offset_of!(lysp_node_grp, typedefs) - 64usize];
    ["Offset of field: lysp_node_grp::groupings"]
        [::std::mem::offset_of!(lysp_node_grp, groupings) - 72usize];
    ["Offset of field: lysp_node_grp::child"]
        [::std::mem::offset_of!(lysp_node_grp, child) - 80usize];
    ["Offset of field: lysp_node_grp::actions"]
        [::std::mem::offset_of!(lysp_node_grp, actions) - 88usize];
    ["Offset of field: lysp_node_grp::notifs"]
        [::std::mem::offset_of!(lysp_node_grp, notifs) - 96usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_augment {
    pub __bindgen_anon_1: lysp_node_augment__bindgen_ty_1,
    pub child: *mut lysp_node,
    pub when: *mut lysp_when,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_augment__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_augment__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_augment,
    pub nodeid: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_augment__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_augment__bindgen_ty_1__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_augment__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_augment__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, parent) - 0usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, nodetype) - 8usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, flags) - 10usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, next) - 16usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::nodeid"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, nodeid) - 24usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, dsc) - 32usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, ref_) - 40usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::iffeatures"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1__bindgen_ty_1, exts) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_augment__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_augment__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_augment__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_augment__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_augment__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_augment"][::std::mem::size_of::<lysp_node_augment>() - 96usize];
    ["Alignment of lysp_node_augment"][::std::mem::align_of::<lysp_node_augment>() - 8usize];
    ["Offset of field: lysp_node_augment::child"]
        [::std::mem::offset_of!(lysp_node_augment, child) - 64usize];
    ["Offset of field: lysp_node_augment::when"]
        [::std::mem::offset_of!(lysp_node_augment, when) - 72usize];
    ["Offset of field: lysp_node_augment::actions"]
        [::std::mem::offset_of!(lysp_node_augment, actions) - 80usize];
    ["Offset of field: lysp_node_augment::notifs"]
        [::std::mem::offset_of!(lysp_node_augment, notifs) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_module {
    pub mod_: *mut lys_module,
    pub revs: *mut lysp_revision,
    pub imports: *mut lysp_import,
    pub includes: *mut lysp_include,
    pub extensions: *mut lysp_ext,
    pub features: *mut lysp_feature,
    pub identities: *mut lysp_ident,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub data: *mut lysp_node,
    pub augments: *mut lysp_node_augment,
    pub rpcs: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
    pub deviations: *mut lysp_deviation,
    pub exts: *mut lysp_ext_instance,
    pub version: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_module"][::std::mem::size_of::<lysp_module>() - 128usize];
    ["Alignment of lysp_module"][::std::mem::align_of::<lysp_module>() - 8usize];
    ["Offset of field: lysp_module::mod_"][::std::mem::offset_of!(lysp_module, mod_) - 0usize];
    ["Offset of field: lysp_module::revs"][::std::mem::offset_of!(lysp_module, revs) - 8usize];
    ["Offset of field: lysp_module::imports"]
        [::std::mem::offset_of!(lysp_module, imports) - 16usize];
    ["Offset of field: lysp_module::includes"]
        [::std::mem::offset_of!(lysp_module, includes) - 24usize];
    ["Offset of field: lysp_module::extensions"]
        [::std::mem::offset_of!(lysp_module, extensions) - 32usize];
    ["Offset of field: lysp_module::features"]
        [::std::mem::offset_of!(lysp_module, features) - 40usize];
    ["Offset of field: lysp_module::identities"]
        [::std::mem::offset_of!(lysp_module, identities) - 48usize];
    ["Offset of field: lysp_module::typedefs"]
        [::std::mem::offset_of!(lysp_module, typedefs) - 56usize];
    ["Offset of field: lysp_module::groupings"]
        [::std::mem::offset_of!(lysp_module, groupings) - 64usize];
    ["Offset of field: lysp_module::data"][::std::mem::offset_of!(lysp_module, data) - 72usize];
    ["Offset of field: lysp_module::augments"]
        [::std::mem::offset_of!(lysp_module, augments) - 80usize];
    ["Offset of field: lysp_module::rpcs"][::std::mem::offset_of!(lysp_module, rpcs) - 88usize];
    ["Offset of field: lysp_module::notifs"][::std::mem::offset_of!(lysp_module, notifs) - 96usize];
    ["Offset of field: lysp_module::deviations"]
        [::std::mem::offset_of!(lysp_module, deviations) - 104usize];
    ["Offset of field: lysp_module::exts"][::std::mem::offset_of!(lysp_module, exts) - 112usize];
    ["Offset of field: lysp_module::version"]
        [::std::mem::offset_of!(lysp_module, version) - 120usize];
};
impl lysp_module {
    #[inline]
    pub fn parsing(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_parsing(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn parsing_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_parsing_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_submod(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_submod(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_submod_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_is_submod_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(parsing: u8, is_submod: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let parsing: u8 = unsafe { ::std::mem::transmute(parsing) };
            parsing as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_submod: u8 = unsafe { ::std::mem::transmute(is_submod) };
            is_submod as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_submodule {
    pub mod_: *mut lys_module,
    pub revs: *mut lysp_revision,
    pub imports: *mut lysp_import,
    pub includes: *mut lysp_include,
    pub extensions: *mut lysp_ext,
    pub features: *mut lysp_feature,
    pub identities: *mut lysp_ident,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub data: *mut lysp_node,
    pub augments: *mut lysp_node_augment,
    pub rpcs: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
    pub deviations: *mut lysp_deviation,
    pub exts: *mut lysp_ext_instance,
    pub version: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub name: *const ::std::os::raw::c_char,
    pub filepath: *const ::std::os::raw::c_char,
    pub prefix: *const ::std::os::raw::c_char,
    pub org: *const ::std::os::raw::c_char,
    pub contact: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_submodule"][::std::mem::size_of::<lysp_submodule>() - 184usize];
    ["Alignment of lysp_submodule"][::std::mem::align_of::<lysp_submodule>() - 8usize];
    ["Offset of field: lysp_submodule::mod_"]
        [::std::mem::offset_of!(lysp_submodule, mod_) - 0usize];
    ["Offset of field: lysp_submodule::revs"]
        [::std::mem::offset_of!(lysp_submodule, revs) - 8usize];
    ["Offset of field: lysp_submodule::imports"]
        [::std::mem::offset_of!(lysp_submodule, imports) - 16usize];
    ["Offset of field: lysp_submodule::includes"]
        [::std::mem::offset_of!(lysp_submodule, includes) - 24usize];
    ["Offset of field: lysp_submodule::extensions"]
        [::std::mem::offset_of!(lysp_submodule, extensions) - 32usize];
    ["Offset of field: lysp_submodule::features"]
        [::std::mem::offset_of!(lysp_submodule, features) - 40usize];
    ["Offset of field: lysp_submodule::identities"]
        [::std::mem::offset_of!(lysp_submodule, identities) - 48usize];
    ["Offset of field: lysp_submodule::typedefs"]
        [::std::mem::offset_of!(lysp_submodule, typedefs) - 56usize];
    ["Offset of field: lysp_submodule::groupings"]
        [::std::mem::offset_of!(lysp_submodule, groupings) - 64usize];
    ["Offset of field: lysp_submodule::data"]
        [::std::mem::offset_of!(lysp_submodule, data) - 72usize];
    ["Offset of field: lysp_submodule::augments"]
        [::std::mem::offset_of!(lysp_submodule, augments) - 80usize];
    ["Offset of field: lysp_submodule::rpcs"]
        [::std::mem::offset_of!(lysp_submodule, rpcs) - 88usize];
    ["Offset of field: lysp_submodule::notifs"]
        [::std::mem::offset_of!(lysp_submodule, notifs) - 96usize];
    ["Offset of field: lysp_submodule::deviations"]
        [::std::mem::offset_of!(lysp_submodule, deviations) - 104usize];
    ["Offset of field: lysp_submodule::exts"]
        [::std::mem::offset_of!(lysp_submodule, exts) - 112usize];
    ["Offset of field: lysp_submodule::version"]
        [::std::mem::offset_of!(lysp_submodule, version) - 120usize];
    ["Offset of field: lysp_submodule::name"]
        [::std::mem::offset_of!(lysp_submodule, name) - 128usize];
    ["Offset of field: lysp_submodule::filepath"]
        [::std::mem::offset_of!(lysp_submodule, filepath) - 136usize];
    ["Offset of field: lysp_submodule::prefix"]
        [::std::mem::offset_of!(lysp_submodule, prefix) - 144usize];
    ["Offset of field: lysp_submodule::org"]
        [::std::mem::offset_of!(lysp_submodule, org) - 152usize];
    ["Offset of field: lysp_submodule::contact"]
        [::std::mem::offset_of!(lysp_submodule, contact) - 160usize];
    ["Offset of field: lysp_submodule::dsc"]
        [::std::mem::offset_of!(lysp_submodule, dsc) - 168usize];
    ["Offset of field: lysp_submodule::ref_"]
        [::std::mem::offset_of!(lysp_submodule, ref_) - 176usize];
};
impl lysp_submodule {
    #[inline]
    pub fn parsing(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_parsing(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn parsing_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_parsing_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_submod(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_submod(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_submod_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_is_submod_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn latest_revision(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_latest_revision(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn latest_revision_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_latest_revision_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        parsing: u8,
        is_submod: u8,
        latest_revision: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let parsing: u8 = unsafe { ::std::mem::transmute(parsing) };
            parsing as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_submod: u8 = unsafe { ::std::mem::transmute(is_submod) };
            is_submod as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let latest_revision: u8 = unsafe { ::std::mem::transmute(latest_revision) };
            latest_revision as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_prefix {
    pub prefix: *mut ::std::os::raw::c_char,
    pub mod_: *const lys_module,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_prefix"][::std::mem::size_of::<lysc_prefix>() - 16usize];
    ["Alignment of lysc_prefix"][::std::mem::align_of::<lysc_prefix>() - 8usize];
    ["Offset of field: lysc_prefix::prefix"][::std::mem::offset_of!(lysc_prefix, prefix) - 0usize];
    ["Offset of field: lysc_prefix::mod_"][::std::mem::offset_of!(lysc_prefix, mod_) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_ext {
    pub name: *const ::std::os::raw::c_char,
    pub argname: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub module: *mut lys_module,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_ext"][::std::mem::size_of::<lysc_ext>() - 48usize];
    ["Alignment of lysc_ext"][::std::mem::align_of::<lysc_ext>() - 8usize];
    ["Offset of field: lysc_ext::name"][::std::mem::offset_of!(lysc_ext, name) - 0usize];
    ["Offset of field: lysc_ext::argname"][::std::mem::offset_of!(lysc_ext, argname) - 8usize];
    ["Offset of field: lysc_ext::exts"][::std::mem::offset_of!(lysc_ext, exts) - 16usize];
    ["Offset of field: lysc_ext::plugin_ref"]
        [::std::mem::offset_of!(lysc_ext, plugin_ref) - 24usize];
    ["Offset of field: lysc_ext::module"][::std::mem::offset_of!(lysc_ext, module) - 32usize];
    ["Offset of field: lysc_ext::flags"][::std::mem::offset_of!(lysc_ext, flags) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_when {
    pub cond: *mut lyxp_expr,
    pub context: *mut lysc_node,
    pub prefixes: *mut lysc_prefix,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub refcount: u32,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_when"][::std::mem::size_of::<lysc_when>() - 56usize];
    ["Alignment of lysc_when"][::std::mem::align_of::<lysc_when>() - 8usize];
    ["Offset of field: lysc_when::cond"][::std::mem::offset_of!(lysc_when, cond) - 0usize];
    ["Offset of field: lysc_when::context"][::std::mem::offset_of!(lysc_when, context) - 8usize];
    ["Offset of field: lysc_when::prefixes"][::std::mem::offset_of!(lysc_when, prefixes) - 16usize];
    ["Offset of field: lysc_when::dsc"][::std::mem::offset_of!(lysc_when, dsc) - 24usize];
    ["Offset of field: lysc_when::ref_"][::std::mem::offset_of!(lysc_when, ref_) - 32usize];
    ["Offset of field: lysc_when::exts"][::std::mem::offset_of!(lysc_when, exts) - 40usize];
    ["Offset of field: lysc_when::refcount"][::std::mem::offset_of!(lysc_when, refcount) - 48usize];
    ["Offset of field: lysc_when::flags"][::std::mem::offset_of!(lysc_when, flags) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_ident {
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub module: *mut lys_module,
    pub derived: *mut *mut lysc_ident,
    pub exts: *mut lysc_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_ident"][::std::mem::size_of::<lysc_ident>() - 56usize];
    ["Alignment of lysc_ident"][::std::mem::align_of::<lysc_ident>() - 8usize];
    ["Offset of field: lysc_ident::name"][::std::mem::offset_of!(lysc_ident, name) - 0usize];
    ["Offset of field: lysc_ident::dsc"][::std::mem::offset_of!(lysc_ident, dsc) - 8usize];
    ["Offset of field: lysc_ident::ref_"][::std::mem::offset_of!(lysc_ident, ref_) - 16usize];
    ["Offset of field: lysc_ident::module"][::std::mem::offset_of!(lysc_ident, module) - 24usize];
    ["Offset of field: lysc_ident::derived"][::std::mem::offset_of!(lysc_ident, derived) - 32usize];
    ["Offset of field: lysc_ident::exts"][::std::mem::offset_of!(lysc_ident, exts) - 40usize];
    ["Offset of field: lysc_ident::flags"][::std::mem::offset_of!(lysc_ident, flags) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_revision {
    pub date: [::std::os::raw::c_char; 11usize],
    pub exts: *mut lysc_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_revision"][::std::mem::size_of::<lysc_revision>() - 24usize];
    ["Alignment of lysc_revision"][::std::mem::align_of::<lysc_revision>() - 8usize];
    ["Offset of field: lysc_revision::date"][::std::mem::offset_of!(lysc_revision, date) - 0usize];
    ["Offset of field: lysc_revision::exts"][::std::mem::offset_of!(lysc_revision, exts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_range {
    pub parts: *mut lysc_range_lysc_range_part,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub emsg: *const ::std::os::raw::c_char,
    pub eapptag: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_range_lysc_range_part {
    pub __bindgen_anon_1: lysc_range_lysc_range_part__bindgen_ty_1,
    pub __bindgen_anon_2: lysc_range_lysc_range_part__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_range_lysc_range_part__bindgen_ty_1 {
    pub min_64: i64,
    pub min_u64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_range_lysc_range_part__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_range_lysc_range_part__bindgen_ty_1>() - 8usize];
    ["Alignment of lysc_range_lysc_range_part__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_range_lysc_range_part__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_range_lysc_range_part__bindgen_ty_1::min_64"]
        [::std::mem::offset_of!(lysc_range_lysc_range_part__bindgen_ty_1, min_64) - 0usize];
    ["Offset of field: lysc_range_lysc_range_part__bindgen_ty_1::min_u64"]
        [::std::mem::offset_of!(lysc_range_lysc_range_part__bindgen_ty_1, min_u64) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_range_lysc_range_part__bindgen_ty_2 {
    pub max_64: i64,
    pub max_u64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_range_lysc_range_part__bindgen_ty_2"]
        [::std::mem::size_of::<lysc_range_lysc_range_part__bindgen_ty_2>() - 8usize];
    ["Alignment of lysc_range_lysc_range_part__bindgen_ty_2"]
        [::std::mem::align_of::<lysc_range_lysc_range_part__bindgen_ty_2>() - 8usize];
    ["Offset of field: lysc_range_lysc_range_part__bindgen_ty_2::max_64"]
        [::std::mem::offset_of!(lysc_range_lysc_range_part__bindgen_ty_2, max_64) - 0usize];
    ["Offset of field: lysc_range_lysc_range_part__bindgen_ty_2::max_u64"]
        [::std::mem::offset_of!(lysc_range_lysc_range_part__bindgen_ty_2, max_u64) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_range_lysc_range_part"]
        [::std::mem::size_of::<lysc_range_lysc_range_part>() - 16usize];
    ["Alignment of lysc_range_lysc_range_part"]
        [::std::mem::align_of::<lysc_range_lysc_range_part>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_range"][::std::mem::size_of::<lysc_range>() - 48usize];
    ["Alignment of lysc_range"][::std::mem::align_of::<lysc_range>() - 8usize];
    ["Offset of field: lysc_range::parts"][::std::mem::offset_of!(lysc_range, parts) - 0usize];
    ["Offset of field: lysc_range::dsc"][::std::mem::offset_of!(lysc_range, dsc) - 8usize];
    ["Offset of field: lysc_range::ref_"][::std::mem::offset_of!(lysc_range, ref_) - 16usize];
    ["Offset of field: lysc_range::emsg"][::std::mem::offset_of!(lysc_range, emsg) - 24usize];
    ["Offset of field: lysc_range::eapptag"][::std::mem::offset_of!(lysc_range, eapptag) - 32usize];
    ["Offset of field: lysc_range::exts"][::std::mem::offset_of!(lysc_range, exts) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_pattern {
    pub expr: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub emsg: *const ::std::os::raw::c_char,
    pub eapptag: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub __bindgen_padding_0: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_pattern"][::std::mem::size_of::<lysc_pattern>() - 56usize];
    ["Alignment of lysc_pattern"][::std::mem::align_of::<lysc_pattern>() - 8usize];
    ["Offset of field: lysc_pattern::expr"][::std::mem::offset_of!(lysc_pattern, expr) - 0usize];
    ["Offset of field: lysc_pattern::dsc"][::std::mem::offset_of!(lysc_pattern, dsc) - 8usize];
    ["Offset of field: lysc_pattern::ref_"][::std::mem::offset_of!(lysc_pattern, ref_) - 16usize];
    ["Offset of field: lysc_pattern::emsg"][::std::mem::offset_of!(lysc_pattern, emsg) - 24usize];
    ["Offset of field: lysc_pattern::eapptag"]
        [::std::mem::offset_of!(lysc_pattern, eapptag) - 32usize];
    ["Offset of field: lysc_pattern::exts"][::std::mem::offset_of!(lysc_pattern, exts) - 40usize];
};
impl lysc_pattern {
    #[inline]
    pub fn inverted(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_inverted(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn inverted_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_inverted_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn format(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn format_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_format_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn refcount(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_refcount(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn refcount_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                30u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_refcount_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                30u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        inverted: u32,
        format: u32,
        refcount: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let inverted: u32 = unsafe { ::std::mem::transmute(inverted) };
            inverted as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let format: u32 = unsafe { ::std::mem::transmute(format) };
            format as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let refcount: u32 = unsafe { ::std::mem::transmute(refcount) };
            refcount as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_must {
    pub cond: *mut lyxp_expr,
    pub prefixes: *mut lysc_prefix,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub emsg: *const ::std::os::raw::c_char,
    pub eapptag: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_must"][::std::mem::size_of::<lysc_must>() - 56usize];
    ["Alignment of lysc_must"][::std::mem::align_of::<lysc_must>() - 8usize];
    ["Offset of field: lysc_must::cond"][::std::mem::offset_of!(lysc_must, cond) - 0usize];
    ["Offset of field: lysc_must::prefixes"][::std::mem::offset_of!(lysc_must, prefixes) - 8usize];
    ["Offset of field: lysc_must::dsc"][::std::mem::offset_of!(lysc_must, dsc) - 16usize];
    ["Offset of field: lysc_must::ref_"][::std::mem::offset_of!(lysc_must, ref_) - 24usize];
    ["Offset of field: lysc_must::emsg"][::std::mem::offset_of!(lysc_must, emsg) - 32usize];
    ["Offset of field: lysc_must::eapptag"][::std::mem::offset_of!(lysc_must, eapptag) - 40usize];
    ["Offset of field: lysc_must::exts"][::std::mem::offset_of!(lysc_must, exts) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type"][::std::mem::size_of::<lysc_type>() - 32usize];
    ["Alignment of lysc_type"][::std::mem::align_of::<lysc_type>() - 8usize];
    ["Offset of field: lysc_type::name"][::std::mem::offset_of!(lysc_type, name) - 0usize];
    ["Offset of field: lysc_type::exts"][::std::mem::offset_of!(lysc_type, exts) - 8usize];
    ["Offset of field: lysc_type::plugin_ref"]
        [::std::mem::offset_of!(lysc_type, plugin_ref) - 16usize];
    ["Offset of field: lysc_type::basetype"][::std::mem::offset_of!(lysc_type, basetype) - 24usize];
    ["Offset of field: lysc_type::refcount"][::std::mem::offset_of!(lysc_type, refcount) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_num {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub range: *mut lysc_range,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_num"][::std::mem::size_of::<lysc_type_num>() - 40usize];
    ["Alignment of lysc_type_num"][::std::mem::align_of::<lysc_type_num>() - 8usize];
    ["Offset of field: lysc_type_num::name"][::std::mem::offset_of!(lysc_type_num, name) - 0usize];
    ["Offset of field: lysc_type_num::exts"][::std::mem::offset_of!(lysc_type_num, exts) - 8usize];
    ["Offset of field: lysc_type_num::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_num, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_num::basetype"]
        [::std::mem::offset_of!(lysc_type_num, basetype) - 24usize];
    ["Offset of field: lysc_type_num::refcount"]
        [::std::mem::offset_of!(lysc_type_num, refcount) - 28usize];
    ["Offset of field: lysc_type_num::range"]
        [::std::mem::offset_of!(lysc_type_num, range) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_dec {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub fraction_digits: u8,
    pub range: *mut lysc_range,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_dec"][::std::mem::size_of::<lysc_type_dec>() - 48usize];
    ["Alignment of lysc_type_dec"][::std::mem::align_of::<lysc_type_dec>() - 8usize];
    ["Offset of field: lysc_type_dec::name"][::std::mem::offset_of!(lysc_type_dec, name) - 0usize];
    ["Offset of field: lysc_type_dec::exts"][::std::mem::offset_of!(lysc_type_dec, exts) - 8usize];
    ["Offset of field: lysc_type_dec::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_dec, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_dec::basetype"]
        [::std::mem::offset_of!(lysc_type_dec, basetype) - 24usize];
    ["Offset of field: lysc_type_dec::refcount"]
        [::std::mem::offset_of!(lysc_type_dec, refcount) - 28usize];
    ["Offset of field: lysc_type_dec::fraction_digits"]
        [::std::mem::offset_of!(lysc_type_dec, fraction_digits) - 32usize];
    ["Offset of field: lysc_type_dec::range"]
        [::std::mem::offset_of!(lysc_type_dec, range) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_str {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub length: *mut lysc_range,
    pub patterns: *mut *mut lysc_pattern,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_str"][::std::mem::size_of::<lysc_type_str>() - 48usize];
    ["Alignment of lysc_type_str"][::std::mem::align_of::<lysc_type_str>() - 8usize];
    ["Offset of field: lysc_type_str::name"][::std::mem::offset_of!(lysc_type_str, name) - 0usize];
    ["Offset of field: lysc_type_str::exts"][::std::mem::offset_of!(lysc_type_str, exts) - 8usize];
    ["Offset of field: lysc_type_str::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_str, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_str::basetype"]
        [::std::mem::offset_of!(lysc_type_str, basetype) - 24usize];
    ["Offset of field: lysc_type_str::refcount"]
        [::std::mem::offset_of!(lysc_type_str, refcount) - 28usize];
    ["Offset of field: lysc_type_str::length"]
        [::std::mem::offset_of!(lysc_type_str, length) - 32usize];
    ["Offset of field: lysc_type_str::patterns"]
        [::std::mem::offset_of!(lysc_type_str, patterns) - 40usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_type_bitenum_item {
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub __bindgen_anon_1: lysc_type_bitenum_item__bindgen_ty_1,
    pub flags: u16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_type_bitenum_item__bindgen_ty_1 {
    pub value: i32,
    pub position: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_bitenum_item__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_type_bitenum_item__bindgen_ty_1>() - 4usize];
    ["Alignment of lysc_type_bitenum_item__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_type_bitenum_item__bindgen_ty_1>() - 4usize];
    ["Offset of field: lysc_type_bitenum_item__bindgen_ty_1::value"]
        [::std::mem::offset_of!(lysc_type_bitenum_item__bindgen_ty_1, value) - 0usize];
    ["Offset of field: lysc_type_bitenum_item__bindgen_ty_1::position"]
        [::std::mem::offset_of!(lysc_type_bitenum_item__bindgen_ty_1, position) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_bitenum_item"][::std::mem::size_of::<lysc_type_bitenum_item>() - 40usize];
    ["Alignment of lysc_type_bitenum_item"]
        [::std::mem::align_of::<lysc_type_bitenum_item>() - 8usize];
    ["Offset of field: lysc_type_bitenum_item::name"]
        [::std::mem::offset_of!(lysc_type_bitenum_item, name) - 0usize];
    ["Offset of field: lysc_type_bitenum_item::dsc"]
        [::std::mem::offset_of!(lysc_type_bitenum_item, dsc) - 8usize];
    ["Offset of field: lysc_type_bitenum_item::ref_"]
        [::std::mem::offset_of!(lysc_type_bitenum_item, ref_) - 16usize];
    ["Offset of field: lysc_type_bitenum_item::exts"]
        [::std::mem::offset_of!(lysc_type_bitenum_item, exts) - 24usize];
    ["Offset of field: lysc_type_bitenum_item::flags"]
        [::std::mem::offset_of!(lysc_type_bitenum_item, flags) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_enum {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub enums: *mut lysc_type_bitenum_item,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_enum"][::std::mem::size_of::<lysc_type_enum>() - 40usize];
    ["Alignment of lysc_type_enum"][::std::mem::align_of::<lysc_type_enum>() - 8usize];
    ["Offset of field: lysc_type_enum::name"]
        [::std::mem::offset_of!(lysc_type_enum, name) - 0usize];
    ["Offset of field: lysc_type_enum::exts"]
        [::std::mem::offset_of!(lysc_type_enum, exts) - 8usize];
    ["Offset of field: lysc_type_enum::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_enum, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_enum::basetype"]
        [::std::mem::offset_of!(lysc_type_enum, basetype) - 24usize];
    ["Offset of field: lysc_type_enum::refcount"]
        [::std::mem::offset_of!(lysc_type_enum, refcount) - 28usize];
    ["Offset of field: lysc_type_enum::enums"]
        [::std::mem::offset_of!(lysc_type_enum, enums) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_bits {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub bits: *mut lysc_type_bitenum_item,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_bits"][::std::mem::size_of::<lysc_type_bits>() - 40usize];
    ["Alignment of lysc_type_bits"][::std::mem::align_of::<lysc_type_bits>() - 8usize];
    ["Offset of field: lysc_type_bits::name"]
        [::std::mem::offset_of!(lysc_type_bits, name) - 0usize];
    ["Offset of field: lysc_type_bits::exts"]
        [::std::mem::offset_of!(lysc_type_bits, exts) - 8usize];
    ["Offset of field: lysc_type_bits::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_bits, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_bits::basetype"]
        [::std::mem::offset_of!(lysc_type_bits, basetype) - 24usize];
    ["Offset of field: lysc_type_bits::refcount"]
        [::std::mem::offset_of!(lysc_type_bits, refcount) - 28usize];
    ["Offset of field: lysc_type_bits::bits"]
        [::std::mem::offset_of!(lysc_type_bits, bits) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_leafref {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub path: *mut lyxp_expr,
    pub prefixes: *mut lysc_prefix,
    pub realtype: *mut lysc_type,
    pub require_instance: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_leafref"][::std::mem::size_of::<lysc_type_leafref>() - 64usize];
    ["Alignment of lysc_type_leafref"][::std::mem::align_of::<lysc_type_leafref>() - 8usize];
    ["Offset of field: lysc_type_leafref::name"]
        [::std::mem::offset_of!(lysc_type_leafref, name) - 0usize];
    ["Offset of field: lysc_type_leafref::exts"]
        [::std::mem::offset_of!(lysc_type_leafref, exts) - 8usize];
    ["Offset of field: lysc_type_leafref::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_leafref, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_leafref::basetype"]
        [::std::mem::offset_of!(lysc_type_leafref, basetype) - 24usize];
    ["Offset of field: lysc_type_leafref::refcount"]
        [::std::mem::offset_of!(lysc_type_leafref, refcount) - 28usize];
    ["Offset of field: lysc_type_leafref::path"]
        [::std::mem::offset_of!(lysc_type_leafref, path) - 32usize];
    ["Offset of field: lysc_type_leafref::prefixes"]
        [::std::mem::offset_of!(lysc_type_leafref, prefixes) - 40usize];
    ["Offset of field: lysc_type_leafref::realtype"]
        [::std::mem::offset_of!(lysc_type_leafref, realtype) - 48usize];
    ["Offset of field: lysc_type_leafref::require_instance"]
        [::std::mem::offset_of!(lysc_type_leafref, require_instance) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_identityref {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub bases: *mut *mut lysc_ident,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_identityref"][::std::mem::size_of::<lysc_type_identityref>() - 40usize];
    ["Alignment of lysc_type_identityref"]
        [::std::mem::align_of::<lysc_type_identityref>() - 8usize];
    ["Offset of field: lysc_type_identityref::name"]
        [::std::mem::offset_of!(lysc_type_identityref, name) - 0usize];
    ["Offset of field: lysc_type_identityref::exts"]
        [::std::mem::offset_of!(lysc_type_identityref, exts) - 8usize];
    ["Offset of field: lysc_type_identityref::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_identityref, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_identityref::basetype"]
        [::std::mem::offset_of!(lysc_type_identityref, basetype) - 24usize];
    ["Offset of field: lysc_type_identityref::refcount"]
        [::std::mem::offset_of!(lysc_type_identityref, refcount) - 28usize];
    ["Offset of field: lysc_type_identityref::bases"]
        [::std::mem::offset_of!(lysc_type_identityref, bases) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_instanceid {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub require_instance: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_instanceid"][::std::mem::size_of::<lysc_type_instanceid>() - 40usize];
    ["Alignment of lysc_type_instanceid"][::std::mem::align_of::<lysc_type_instanceid>() - 8usize];
    ["Offset of field: lysc_type_instanceid::name"]
        [::std::mem::offset_of!(lysc_type_instanceid, name) - 0usize];
    ["Offset of field: lysc_type_instanceid::exts"]
        [::std::mem::offset_of!(lysc_type_instanceid, exts) - 8usize];
    ["Offset of field: lysc_type_instanceid::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_instanceid, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_instanceid::basetype"]
        [::std::mem::offset_of!(lysc_type_instanceid, basetype) - 24usize];
    ["Offset of field: lysc_type_instanceid::refcount"]
        [::std::mem::offset_of!(lysc_type_instanceid, refcount) - 28usize];
    ["Offset of field: lysc_type_instanceid::require_instance"]
        [::std::mem::offset_of!(lysc_type_instanceid, require_instance) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_union {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub types: *mut *mut lysc_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_union"][::std::mem::size_of::<lysc_type_union>() - 40usize];
    ["Alignment of lysc_type_union"][::std::mem::align_of::<lysc_type_union>() - 8usize];
    ["Offset of field: lysc_type_union::name"]
        [::std::mem::offset_of!(lysc_type_union, name) - 0usize];
    ["Offset of field: lysc_type_union::exts"]
        [::std::mem::offset_of!(lysc_type_union, exts) - 8usize];
    ["Offset of field: lysc_type_union::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_union, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_union::basetype"]
        [::std::mem::offset_of!(lysc_type_union, basetype) - 24usize];
    ["Offset of field: lysc_type_union::refcount"]
        [::std::mem::offset_of!(lysc_type_union, refcount) - 28usize];
    ["Offset of field: lysc_type_union::types"]
        [::std::mem::offset_of!(lysc_type_union, types) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_type_bin {
    pub name: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub plugin_ref: usize,
    pub basetype: LY_DATA_TYPE,
    pub refcount: u32,
    pub length: *mut lysc_range,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_type_bin"][::std::mem::size_of::<lysc_type_bin>() - 40usize];
    ["Alignment of lysc_type_bin"][::std::mem::align_of::<lysc_type_bin>() - 8usize];
    ["Offset of field: lysc_type_bin::name"][::std::mem::offset_of!(lysc_type_bin, name) - 0usize];
    ["Offset of field: lysc_type_bin::exts"][::std::mem::offset_of!(lysc_type_bin, exts) - 8usize];
    ["Offset of field: lysc_type_bin::plugin_ref"]
        [::std::mem::offset_of!(lysc_type_bin, plugin_ref) - 16usize];
    ["Offset of field: lysc_type_bin::basetype"]
        [::std::mem::offset_of!(lysc_type_bin, basetype) - 24usize];
    ["Offset of field: lysc_type_bin::refcount"]
        [::std::mem::offset_of!(lysc_type_bin, refcount) - 28usize];
    ["Offset of field: lysc_type_bin::length"]
        [::std::mem::offset_of!(lysc_type_bin, length) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node"][::std::mem::size_of::<lysc_node>() - 80usize];
    ["Alignment of lysc_node"][::std::mem::align_of::<lysc_node>() - 8usize];
    ["Offset of field: lysc_node::nodetype"][::std::mem::offset_of!(lysc_node, nodetype) - 0usize];
    ["Offset of field: lysc_node::flags"][::std::mem::offset_of!(lysc_node, flags) - 2usize];
    ["Offset of field: lysc_node::hash"][::std::mem::offset_of!(lysc_node, hash) - 4usize];
    ["Offset of field: lysc_node::module"][::std::mem::offset_of!(lysc_node, module) - 8usize];
    ["Offset of field: lysc_node::parent"][::std::mem::offset_of!(lysc_node, parent) - 16usize];
    ["Offset of field: lysc_node::next"][::std::mem::offset_of!(lysc_node, next) - 24usize];
    ["Offset of field: lysc_node::prev"][::std::mem::offset_of!(lysc_node, prev) - 32usize];
    ["Offset of field: lysc_node::name"][::std::mem::offset_of!(lysc_node, name) - 40usize];
    ["Offset of field: lysc_node::dsc"][::std::mem::offset_of!(lysc_node, dsc) - 48usize];
    ["Offset of field: lysc_node::ref_"][::std::mem::offset_of!(lysc_node, ref_) - 56usize];
    ["Offset of field: lysc_node::exts"][::std::mem::offset_of!(lysc_node, exts) - 64usize];
    ["Offset of field: lysc_node::priv_"][::std::mem::offset_of!(lysc_node, priv_) - 72usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_action_inout {
    pub __bindgen_anon_1: lysc_node_action_inout__bindgen_ty_1,
    pub child: *mut lysc_node,
    pub musts: *mut lysc_must,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_action_inout__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 0usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        flags
    ) - 2usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::module"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        module
    ) - 8usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        parent
    ) - 16usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        next
    ) - 24usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::prev"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        prev
    ) - 32usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        name
    ) - 40usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        ref_
    ) - 56usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        exts
    ) - 64usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1::priv_"][::std::mem::offset_of!(
        lysc_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        priv_
    ) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_action_inout__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_action_inout__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_action_inout__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_action_inout__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_action_inout__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_action_inout__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_action_inout"][::std::mem::size_of::<lysc_node_action_inout>() - 96usize];
    ["Alignment of lysc_node_action_inout"]
        [::std::mem::align_of::<lysc_node_action_inout>() - 8usize];
    ["Offset of field: lysc_node_action_inout::child"]
        [::std::mem::offset_of!(lysc_node_action_inout, child) - 80usize];
    ["Offset of field: lysc_node_action_inout::musts"]
        [::std::mem::offset_of!(lysc_node_action_inout, musts) - 88usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_action {
    pub __bindgen_anon_1: lysc_node_action__bindgen_ty_1,
    pub when: *mut *mut lysc_when,
    pub input: lysc_node_action_inout,
    pub output: lysc_node_action_inout,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_action__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_action__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_action__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node_action,
    pub prev: *mut lysc_node_action,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_action__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_action__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_action__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_action__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_action__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_action__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_action__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_action__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_action__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_action__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_action"][::std::mem::size_of::<lysc_node_action>() - 280usize];
    ["Alignment of lysc_node_action"][::std::mem::align_of::<lysc_node_action>() - 8usize];
    ["Offset of field: lysc_node_action::when"]
        [::std::mem::offset_of!(lysc_node_action, when) - 80usize];
    ["Offset of field: lysc_node_action::input"]
        [::std::mem::offset_of!(lysc_node_action, input) - 88usize];
    ["Offset of field: lysc_node_action::output"]
        [::std::mem::offset_of!(lysc_node_action, output) - 184usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_notif {
    pub __bindgen_anon_1: lysc_node_notif__bindgen_ty_1,
    pub child: *mut lysc_node,
    pub musts: *mut lysc_must,
    pub when: *mut *mut lysc_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_notif__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_notif__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_notif__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node_notif,
    pub prev: *mut lysc_node_notif,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_notif__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_notif__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_notif__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_notif__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_notif__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_notif__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_notif__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_notif__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_notif__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_notif__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_notif"][::std::mem::size_of::<lysc_node_notif>() - 104usize];
    ["Alignment of lysc_node_notif"][::std::mem::align_of::<lysc_node_notif>() - 8usize];
    ["Offset of field: lysc_node_notif::child"]
        [::std::mem::offset_of!(lysc_node_notif, child) - 80usize];
    ["Offset of field: lysc_node_notif::musts"]
        [::std::mem::offset_of!(lysc_node_notif, musts) - 88usize];
    ["Offset of field: lysc_node_notif::when"]
        [::std::mem::offset_of!(lysc_node_notif, when) - 96usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_container {
    pub __bindgen_anon_1: lysc_node_container__bindgen_ty_1,
    pub child: *mut lysc_node,
    pub musts: *mut lysc_must,
    pub when: *mut *mut lysc_when,
    pub actions: *mut lysc_node_action,
    pub notifs: *mut lysc_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_container__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_container__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_container__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_container__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_container__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_container__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_container__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysc_node_container__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 0usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_container__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_container__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_container__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_container__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_container__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_container__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_container"][::std::mem::size_of::<lysc_node_container>() - 120usize];
    ["Alignment of lysc_node_container"][::std::mem::align_of::<lysc_node_container>() - 8usize];
    ["Offset of field: lysc_node_container::child"]
        [::std::mem::offset_of!(lysc_node_container, child) - 80usize];
    ["Offset of field: lysc_node_container::musts"]
        [::std::mem::offset_of!(lysc_node_container, musts) - 88usize];
    ["Offset of field: lysc_node_container::when"]
        [::std::mem::offset_of!(lysc_node_container, when) - 96usize];
    ["Offset of field: lysc_node_container::actions"]
        [::std::mem::offset_of!(lysc_node_container, actions) - 104usize];
    ["Offset of field: lysc_node_container::notifs"]
        [::std::mem::offset_of!(lysc_node_container, notifs) - 112usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_case {
    pub __bindgen_anon_1: lysc_node_case__bindgen_ty_1,
    pub child: *mut lysc_node,
    pub when: *mut *mut lysc_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_case__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_case__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_case__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_case__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_case__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_case__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_case__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_case__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_case__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_case__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_case__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_case__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_case__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_case"][::std::mem::size_of::<lysc_node_case>() - 96usize];
    ["Alignment of lysc_node_case"][::std::mem::align_of::<lysc_node_case>() - 8usize];
    ["Offset of field: lysc_node_case::child"]
        [::std::mem::offset_of!(lysc_node_case, child) - 80usize];
    ["Offset of field: lysc_node_case::when"]
        [::std::mem::offset_of!(lysc_node_case, when) - 88usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_choice {
    pub __bindgen_anon_1: lysc_node_choice__bindgen_ty_1,
    pub cases: *mut lysc_node_case,
    pub when: *mut *mut lysc_when,
    pub dflt: *mut lysc_node_case,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_choice__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_choice__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_choice__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_choice__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_choice__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_choice__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_choice__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_choice__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_choice__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_choice__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_choice__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_choice__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_choice__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_choice"][::std::mem::size_of::<lysc_node_choice>() - 104usize];
    ["Alignment of lysc_node_choice"][::std::mem::align_of::<lysc_node_choice>() - 8usize];
    ["Offset of field: lysc_node_choice::cases"]
        [::std::mem::offset_of!(lysc_node_choice, cases) - 80usize];
    ["Offset of field: lysc_node_choice::when"]
        [::std::mem::offset_of!(lysc_node_choice, when) - 88usize];
    ["Offset of field: lysc_node_choice::dflt"]
        [::std::mem::offset_of!(lysc_node_choice, dflt) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_value {
    pub str_: *const ::std::os::raw::c_char,
    pub prefixes: *mut lysc_prefix,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_value"][::std::mem::size_of::<lysc_value>() - 16usize];
    ["Alignment of lysc_value"][::std::mem::align_of::<lysc_value>() - 8usize];
    ["Offset of field: lysc_value::str_"][::std::mem::offset_of!(lysc_value, str_) - 0usize];
    ["Offset of field: lysc_value::prefixes"]
        [::std::mem::offset_of!(lysc_value, prefixes) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_leaf {
    pub __bindgen_anon_1: lysc_node_leaf__bindgen_ty_1,
    pub musts: *mut lysc_must,
    pub when: *mut *mut lysc_when,
    pub type_: *mut lysc_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysc_value,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_leaf__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_leaf__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_leaf__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_leaf__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_leaf__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_leaf__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_leaf__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_leaf__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_leaf__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_leaf__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_leaf__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_leaf__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_leaf"][::std::mem::size_of::<lysc_node_leaf>() - 128usize];
    ["Alignment of lysc_node_leaf"][::std::mem::align_of::<lysc_node_leaf>() - 8usize];
    ["Offset of field: lysc_node_leaf::musts"]
        [::std::mem::offset_of!(lysc_node_leaf, musts) - 80usize];
    ["Offset of field: lysc_node_leaf::when"]
        [::std::mem::offset_of!(lysc_node_leaf, when) - 88usize];
    ["Offset of field: lysc_node_leaf::type_"]
        [::std::mem::offset_of!(lysc_node_leaf, type_) - 96usize];
    ["Offset of field: lysc_node_leaf::units"]
        [::std::mem::offset_of!(lysc_node_leaf, units) - 104usize];
    ["Offset of field: lysc_node_leaf::dflt"]
        [::std::mem::offset_of!(lysc_node_leaf, dflt) - 112usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_leaflist {
    pub __bindgen_anon_1: lysc_node_leaflist__bindgen_ty_1,
    pub musts: *mut lysc_must,
    pub when: *mut *mut lysc_when,
    pub type_: *mut lysc_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflts: *mut lysc_value,
    pub min: u32,
    pub max: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_leaflist__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_leaflist__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_leaflist__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_leaflist__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_leaflist__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_leaflist__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_leaflist__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_leaflist"][::std::mem::size_of::<lysc_node_leaflist>() - 128usize];
    ["Alignment of lysc_node_leaflist"][::std::mem::align_of::<lysc_node_leaflist>() - 8usize];
    ["Offset of field: lysc_node_leaflist::musts"]
        [::std::mem::offset_of!(lysc_node_leaflist, musts) - 80usize];
    ["Offset of field: lysc_node_leaflist::when"]
        [::std::mem::offset_of!(lysc_node_leaflist, when) - 88usize];
    ["Offset of field: lysc_node_leaflist::type_"]
        [::std::mem::offset_of!(lysc_node_leaflist, type_) - 96usize];
    ["Offset of field: lysc_node_leaflist::units"]
        [::std::mem::offset_of!(lysc_node_leaflist, units) - 104usize];
    ["Offset of field: lysc_node_leaflist::dflts"]
        [::std::mem::offset_of!(lysc_node_leaflist, dflts) - 112usize];
    ["Offset of field: lysc_node_leaflist::min"]
        [::std::mem::offset_of!(lysc_node_leaflist, min) - 120usize];
    ["Offset of field: lysc_node_leaflist::max"]
        [::std::mem::offset_of!(lysc_node_leaflist, max) - 124usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_list {
    pub __bindgen_anon_1: lysc_node_list__bindgen_ty_1,
    pub child: *mut lysc_node,
    pub musts: *mut lysc_must,
    pub when: *mut *mut lysc_when,
    pub actions: *mut lysc_node_action,
    pub notifs: *mut lysc_node_notif,
    pub uniques: *mut *mut *mut lysc_node_leaf,
    pub min: u32,
    pub max: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_list__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_list__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_list__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_list__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_list__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_list__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_list__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_list__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_list__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_list__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_list__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_list__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_list__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_list"][::std::mem::size_of::<lysc_node_list>() - 136usize];
    ["Alignment of lysc_node_list"][::std::mem::align_of::<lysc_node_list>() - 8usize];
    ["Offset of field: lysc_node_list::child"]
        [::std::mem::offset_of!(lysc_node_list, child) - 80usize];
    ["Offset of field: lysc_node_list::musts"]
        [::std::mem::offset_of!(lysc_node_list, musts) - 88usize];
    ["Offset of field: lysc_node_list::when"]
        [::std::mem::offset_of!(lysc_node_list, when) - 96usize];
    ["Offset of field: lysc_node_list::actions"]
        [::std::mem::offset_of!(lysc_node_list, actions) - 104usize];
    ["Offset of field: lysc_node_list::notifs"]
        [::std::mem::offset_of!(lysc_node_list, notifs) - 112usize];
    ["Offset of field: lysc_node_list::uniques"]
        [::std::mem::offset_of!(lysc_node_list, uniques) - 120usize];
    ["Offset of field: lysc_node_list::min"]
        [::std::mem::offset_of!(lysc_node_list, min) - 128usize];
    ["Offset of field: lysc_node_list::max"]
        [::std::mem::offset_of!(lysc_node_list, max) - 132usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysc_node_anydata {
    pub __bindgen_anon_1: lysc_node_anydata__bindgen_ty_1,
    pub musts: *mut lysc_must,
    pub when: *mut *mut lysc_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysc_node_anydata__bindgen_ty_1 {
    pub node: lysc_node,
    pub __bindgen_anon_1: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_node_anydata__bindgen_ty_1__bindgen_ty_1 {
    pub nodetype: u16,
    pub flags: u16,
    pub hash: [u8; 4usize],
    pub module: *mut lys_module,
    pub parent: *mut lysc_node,
    pub next: *mut lysc_node,
    pub prev: *mut lysc_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysc_ext_instance,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_anydata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_anydata__bindgen_ty_1__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_anydata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_anydata__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, nodetype) - 0usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, flags) - 2usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, hash) - 4usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::module"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, module) - 8usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, name) - 40usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::dsc"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, dsc) - 48usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, ref_) - 56usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, exts) - 64usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1__bindgen_ty_1, priv_) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_anydata__bindgen_ty_1"]
        [::std::mem::size_of::<lysc_node_anydata__bindgen_ty_1>() - 80usize];
    ["Alignment of lysc_node_anydata__bindgen_ty_1"]
        [::std::mem::align_of::<lysc_node_anydata__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysc_node_anydata__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysc_node_anydata__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_node_anydata"][::std::mem::size_of::<lysc_node_anydata>() - 96usize];
    ["Alignment of lysc_node_anydata"][::std::mem::align_of::<lysc_node_anydata>() - 8usize];
    ["Offset of field: lysc_node_anydata::musts"]
        [::std::mem::offset_of!(lysc_node_anydata, musts) - 80usize];
    ["Offset of field: lysc_node_anydata::when"]
        [::std::mem::offset_of!(lysc_node_anydata, when) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_submodule {
    pub name: *const ::std::os::raw::c_char,
    pub revision: *const ::std::os::raw::c_char,
    pub filepath: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_submodule"][::std::mem::size_of::<lysc_submodule>() - 24usize];
    ["Alignment of lysc_submodule"][::std::mem::align_of::<lysc_submodule>() - 8usize];
    ["Offset of field: lysc_submodule::name"]
        [::std::mem::offset_of!(lysc_submodule, name) - 0usize];
    ["Offset of field: lysc_submodule::revision"]
        [::std::mem::offset_of!(lysc_submodule, revision) - 8usize];
    ["Offset of field: lysc_submodule::filepath"]
        [::std::mem::offset_of!(lysc_submodule, filepath) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_module {
    pub mod_: *mut lys_module,
    pub features: *mut *const ::std::os::raw::c_char,
    pub data: *mut lysc_node,
    pub rpcs: *mut lysc_node_action,
    pub notifs: *mut lysc_node_notif,
    pub exts: *mut lysc_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_module"][::std::mem::size_of::<lysc_module>() - 48usize];
    ["Alignment of lysc_module"][::std::mem::align_of::<lysc_module>() - 8usize];
    ["Offset of field: lysc_module::mod_"][::std::mem::offset_of!(lysc_module, mod_) - 0usize];
    ["Offset of field: lysc_module::features"]
        [::std::mem::offset_of!(lysc_module, features) - 8usize];
    ["Offset of field: lysc_module::data"][::std::mem::offset_of!(lysc_module, data) - 16usize];
    ["Offset of field: lysc_module::rpcs"][::std::mem::offset_of!(lysc_module, rpcs) - 24usize];
    ["Offset of field: lysc_module::notifs"][::std::mem::offset_of!(lysc_module, notifs) - 32usize];
    ["Offset of field: lysc_module::exts"][::std::mem::offset_of!(lysc_module, exts) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyplg_type {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn lysc_get_type_plugin(plugin_ref: usize) -> *mut lyplg_type;
}
unsafe extern "C" {
    pub fn lysc_get_ext_plugin(plugin_ref: usize) -> *mut lyplg_ext;
}
unsafe extern "C" {
    pub fn lysc_data_node(schema: *const lysc_node) -> *const lysc_node;
}
unsafe extern "C" {
    pub fn lysc_has_when(node: *const lysc_node) -> *const lysc_when;
}
unsafe extern "C" {
    pub fn lysc_owner_module(node: *const lysc_node) -> *const lys_module;
}
unsafe extern "C" {
    pub fn lysp_node_groupings(node: *const lysp_node) -> *const lysp_node_grp;
}
unsafe extern "C" {
    pub fn lysp_node_typedefs(node: *const lysp_node) -> *const lysp_tpdf;
}
unsafe extern "C" {
    pub fn lysp_node_actions(node: *const lysp_node) -> *const lysp_node_action;
}
unsafe extern "C" {
    pub fn lysp_node_notifs(node: *const lysp_node) -> *const lysp_node_notif;
}
unsafe extern "C" {
    pub fn lysp_node_child(node: *const lysp_node) -> *const lysp_node;
}
unsafe extern "C" {
    pub fn lysc_node_actions(node: *const lysc_node) -> *const lysc_node_action;
}
unsafe extern "C" {
    pub fn lysc_node_notifs(node: *const lysc_node) -> *const lysc_node_notif;
}
unsafe extern "C" {
    pub fn lysc_node_child(node: *const lysc_node) -> *const lysc_node;
}
unsafe extern "C" {
    pub fn lysc_node_musts(node: *const lysc_node) -> *mut lysc_must;
}
unsafe extern "C" {
    pub fn lysc_node_when(node: *const lysc_node) -> *mut *mut lysc_when;
}
unsafe extern "C" {
    pub fn lysc_node_lref_target(node: *const lysc_node) -> *const lysc_node;
}
unsafe extern "C" {
    pub fn lysc_node_lref_targets(node: *const lysc_node, set: *mut *mut ly_set) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lysc_node_lref_backlinks(
        ctx: *const ly_ctx,
        node: *const lysc_node,
        match_ancestors: ly_bool,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
pub type lysc_dfs_clb = ::std::option::Option<
    unsafe extern "C" fn(
        node: *mut lysc_node,
        data: *mut ::std::os::raw::c_void,
        dfs_continue: *mut ly_bool,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn lysc_tree_dfs_full(
        root: *const lysc_node,
        dfs_clb: lysc_dfs_clb,
        data: *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lysc_module_dfs_full(
        mod_: *const lys_module,
        dfs_clb: lysc_dfs_clb,
        data: *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lysc_iffeature_value(iff: *const lysc_iffeature) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_identity_iffeature_value(ident: *const lysc_ident) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lysp_feature_next(
        last: *const lysp_feature,
        pmod: *const lysp_module,
        idx: *mut u32,
    ) -> *mut lysp_feature;
}
unsafe extern "C" {
    pub fn lys_find_module(
        ctx: *const ly_ctx,
        ctx_node: *const lysc_node,
        prefix: *const ::std::os::raw::c_char,
        prefix_len: u32,
        format: LY_VALUE_FORMAT,
        prefix_data: *const ::std::os::raw::c_void,
    ) -> *const lys_module;
}
unsafe extern "C" {
    pub fn lys_getnext(
        last: *const lysc_node,
        parent: *const lysc_node,
        module: *const lysc_module,
        options: u32,
    ) -> *const lysc_node;
}
unsafe extern "C" {
    pub fn lys_find_child(
        ctx: *const ly_ctx,
        parent: *const lysc_node,
        mod_: *const lys_module,
        mod_name: *const ::std::os::raw::c_char,
        mod_len: u32,
        name: *const ::std::os::raw::c_char,
        name_len: u32,
        options: u32,
    ) -> *const lysc_node;
}
unsafe extern "C" {
    pub fn lys_find_xpath_atoms(
        ctx: *const ly_ctx,
        ctx_node: *const lysc_node,
        xpath: *const ::std::os::raw::c_char,
        options: u32,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_find_expr_atoms(
        ctx_node: *const lysc_node,
        cur_mod: *const lys_module,
        expr: *const lyxp_expr,
        prefixes: *const lysc_prefix,
        options: u32,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_find_xpath(
        ctx: *const ly_ctx,
        ctx_node: *const lysc_node,
        xpath: *const ::std::os::raw::c_char,
        options: u32,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_find_lypath_atoms(path: *const ly_path, set: *mut *mut ly_set) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_find_path_atoms(
        ctx: *const ly_ctx,
        ctx_node: *const lysc_node,
        path: *const ::std::os::raw::c_char,
        output: ly_bool,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_find_path(
        ctx: *const ly_ctx,
        ctx_node: *const lysc_node,
        path: *const ::std::os::raw::c_char,
        output: ly_bool,
    ) -> *const lysc_node;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LYSC_PATH_TYPE {
    LYSC_PATH_LOG = 0,
    LYSC_PATH_DATA = 1,
    LYSC_PATH_DATA_PATTERN = 2,
}
unsafe extern "C" {
    pub fn lysc_path(
        node: *const lysc_node,
        pathtype: LYSC_PATH_TYPE,
        buffer: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lys_module {
    pub ctx: *mut ly_ctx,
    pub name: *const ::std::os::raw::c_char,
    pub revision: *const ::std::os::raw::c_char,
    pub ns: *const ::std::os::raw::c_char,
    pub prefix: *const ::std::os::raw::c_char,
    pub filepath: *const ::std::os::raw::c_char,
    pub org: *const ::std::os::raw::c_char,
    pub contact: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub parsed: *mut lysp_module,
    pub compiled: *mut lysc_module,
    pub extensions: *mut lysc_ext,
    pub identities: *mut lysc_ident,
    pub submodules: *mut lysc_submodule,
    pub augmented_by: *mut *mut lys_module,
    pub deviated_by: *mut *mut lys_module,
    pub implemented: ly_bool,
    pub to_compile: ly_bool,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lys_module"][::std::mem::size_of::<lys_module>() - 144usize];
    ["Alignment of lys_module"][::std::mem::align_of::<lys_module>() - 8usize];
    ["Offset of field: lys_module::ctx"][::std::mem::offset_of!(lys_module, ctx) - 0usize];
    ["Offset of field: lys_module::name"][::std::mem::offset_of!(lys_module, name) - 8usize];
    ["Offset of field: lys_module::revision"]
        [::std::mem::offset_of!(lys_module, revision) - 16usize];
    ["Offset of field: lys_module::ns"][::std::mem::offset_of!(lys_module, ns) - 24usize];
    ["Offset of field: lys_module::prefix"][::std::mem::offset_of!(lys_module, prefix) - 32usize];
    ["Offset of field: lys_module::filepath"]
        [::std::mem::offset_of!(lys_module, filepath) - 40usize];
    ["Offset of field: lys_module::org"][::std::mem::offset_of!(lys_module, org) - 48usize];
    ["Offset of field: lys_module::contact"][::std::mem::offset_of!(lys_module, contact) - 56usize];
    ["Offset of field: lys_module::dsc"][::std::mem::offset_of!(lys_module, dsc) - 64usize];
    ["Offset of field: lys_module::ref_"][::std::mem::offset_of!(lys_module, ref_) - 72usize];
    ["Offset of field: lys_module::parsed"][::std::mem::offset_of!(lys_module, parsed) - 80usize];
    ["Offset of field: lys_module::compiled"]
        [::std::mem::offset_of!(lys_module, compiled) - 88usize];
    ["Offset of field: lys_module::extensions"]
        [::std::mem::offset_of!(lys_module, extensions) - 96usize];
    ["Offset of field: lys_module::identities"]
        [::std::mem::offset_of!(lys_module, identities) - 104usize];
    ["Offset of field: lys_module::submodules"]
        [::std::mem::offset_of!(lys_module, submodules) - 112usize];
    ["Offset of field: lys_module::augmented_by"]
        [::std::mem::offset_of!(lys_module, augmented_by) - 120usize];
    ["Offset of field: lys_module::deviated_by"]
        [::std::mem::offset_of!(lys_module, deviated_by) - 128usize];
    ["Offset of field: lys_module::implemented"]
        [::std::mem::offset_of!(lys_module, implemented) - 136usize];
    ["Offset of field: lys_module::to_compile"]
        [::std::mem::offset_of!(lys_module, to_compile) - 137usize];
};
impl lys_module {
    #[inline]
    pub fn version(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_version(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn version_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_version_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn latest_revision(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_latest_revision(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn latest_revision_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_latest_revision_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(version: u8, latest_revision: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let version: u8 = unsafe { ::std::mem::transmute(version) };
            version as u64
        });
        __bindgen_bitfield_unit.set(2usize, 4u8, {
            let latest_revision: u8 = unsafe { ::std::mem::transmute(latest_revision) };
            latest_revision as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    pub fn lys_feature_value(
        module: *const lys_module,
        feature: *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_set_implemented(
        mod_: *mut lys_module,
        features: *mut *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_nodetype2str(nodetype: u16) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lyxp_get_expr(path: *const lyxp_expr) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyxp_var {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_node {
    _unused: [u8; 0],
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LYD_FORMAT {
    LYD_UNKNOWN = 0,
    LYD_XML = 1,
    LYD_JSON = 2,
    LYD_LYB = 3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_value {
    pub _canonical: *const ::std::os::raw::c_char,
    pub realtype: *const lysc_type,
    pub __bindgen_anon_1: lyd_value__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lyd_value__bindgen_ty_1 {
    pub boolean: i8,
    pub dec64: i64,
    pub int8: i8,
    pub int16: i16,
    pub int32: i32,
    pub int64: i64,
    pub uint8: u8,
    pub uint16: u16,
    pub uint32: u32,
    pub uint64: u64,
    pub enum_item: *mut lysc_type_bitenum_item,
    pub ident: *mut lysc_ident,
    pub target: *mut ly_path,
    pub subvalue: *mut lyd_value_union,
    pub dyn_mem: *mut ::std::os::raw::c_void,
    pub fixed_mem: [u8; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value__bindgen_ty_1"][::std::mem::size_of::<lyd_value__bindgen_ty_1>() - 24usize];
    ["Alignment of lyd_value__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_value__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_value__bindgen_ty_1::boolean"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, boolean) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::dec64"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, dec64) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::int8"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, int8) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::int16"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, int16) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::int32"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, int32) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::int64"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, int64) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::uint8"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, uint8) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::uint16"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, uint16) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::uint32"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, uint32) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::uint64"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, uint64) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::enum_item"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, enum_item) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::ident"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, ident) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::target"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, target) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::subvalue"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, subvalue) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::dyn_mem"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, dyn_mem) - 0usize];
    ["Offset of field: lyd_value__bindgen_ty_1::fixed_mem"]
        [::std::mem::offset_of!(lyd_value__bindgen_ty_1, fixed_mem) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value"][::std::mem::size_of::<lyd_value>() - 40usize];
    ["Alignment of lyd_value"][::std::mem::align_of::<lyd_value>() - 8usize];
    ["Offset of field: lyd_value::_canonical"]
        [::std::mem::offset_of!(lyd_value, _canonical) - 0usize];
    ["Offset of field: lyd_value::realtype"][::std::mem::offset_of!(lyd_value, realtype) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_value_union {
    pub value: lyd_value,
    pub original: *mut ::std::os::raw::c_void,
    pub orig_size_bits: u64,
    pub hints: u32,
    pub format: LY_VALUE_FORMAT,
    pub prefix_data: *mut ::std::os::raw::c_void,
    pub ctx_node: *const lysc_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_union"][::std::mem::size_of::<lyd_value_union>() - 80usize];
    ["Alignment of lyd_value_union"][::std::mem::align_of::<lyd_value_union>() - 8usize];
    ["Offset of field: lyd_value_union::value"]
        [::std::mem::offset_of!(lyd_value_union, value) - 0usize];
    ["Offset of field: lyd_value_union::original"]
        [::std::mem::offset_of!(lyd_value_union, original) - 40usize];
    ["Offset of field: lyd_value_union::orig_size_bits"]
        [::std::mem::offset_of!(lyd_value_union, orig_size_bits) - 48usize];
    ["Offset of field: lyd_value_union::hints"]
        [::std::mem::offset_of!(lyd_value_union, hints) - 56usize];
    ["Offset of field: lyd_value_union::format"]
        [::std::mem::offset_of!(lyd_value_union, format) - 60usize];
    ["Offset of field: lyd_value_union::prefix_data"]
        [::std::mem::offset_of!(lyd_value_union, prefix_data) - 64usize];
    ["Offset of field: lyd_value_union::ctx_node"]
        [::std::mem::offset_of!(lyd_value_union, ctx_node) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_bits {
    pub bitmap: *mut ::std::os::raw::c_char,
    pub items: *mut *mut lysc_type_bitenum_item,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_bits"][::std::mem::size_of::<lyd_value_bits>() - 16usize];
    ["Alignment of lyd_value_bits"][::std::mem::align_of::<lyd_value_bits>() - 8usize];
    ["Offset of field: lyd_value_bits::bitmap"]
        [::std::mem::offset_of!(lyd_value_bits, bitmap) - 0usize];
    ["Offset of field: lyd_value_bits::items"]
        [::std::mem::offset_of!(lyd_value_bits, items) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_binary {
    pub data: *mut ::std::os::raw::c_void,
    pub size: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_binary"][::std::mem::size_of::<lyd_value_binary>() - 16usize];
    ["Alignment of lyd_value_binary"][::std::mem::align_of::<lyd_value_binary>() - 8usize];
    ["Offset of field: lyd_value_binary::data"]
        [::std::mem::offset_of!(lyd_value_binary, data) - 0usize];
    ["Offset of field: lyd_value_binary::size"]
        [::std::mem::offset_of!(lyd_value_binary, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_ipv4_address_no_zone {
    pub addr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_ipv4_address_no_zone"]
        [::std::mem::size_of::<lyd_value_ipv4_address_no_zone>() - 4usize];
    ["Alignment of lyd_value_ipv4_address_no_zone"]
        [::std::mem::align_of::<lyd_value_ipv4_address_no_zone>() - 4usize];
    ["Offset of field: lyd_value_ipv4_address_no_zone::addr"]
        [::std::mem::offset_of!(lyd_value_ipv4_address_no_zone, addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_ipv4_address {
    pub addr: in_addr,
    pub zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_ipv4_address"][::std::mem::size_of::<lyd_value_ipv4_address>() - 16usize];
    ["Alignment of lyd_value_ipv4_address"]
        [::std::mem::align_of::<lyd_value_ipv4_address>() - 8usize];
    ["Offset of field: lyd_value_ipv4_address::addr"]
        [::std::mem::offset_of!(lyd_value_ipv4_address, addr) - 0usize];
    ["Offset of field: lyd_value_ipv4_address::zone"]
        [::std::mem::offset_of!(lyd_value_ipv4_address, zone) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_ipv4_prefix {
    pub addr: in_addr,
    pub prefix: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_ipv4_prefix"][::std::mem::size_of::<lyd_value_ipv4_prefix>() - 8usize];
    ["Alignment of lyd_value_ipv4_prefix"]
        [::std::mem::align_of::<lyd_value_ipv4_prefix>() - 4usize];
    ["Offset of field: lyd_value_ipv4_prefix::addr"]
        [::std::mem::offset_of!(lyd_value_ipv4_prefix, addr) - 0usize];
    ["Offset of field: lyd_value_ipv4_prefix::prefix"]
        [::std::mem::offset_of!(lyd_value_ipv4_prefix, prefix) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_value_ipv6_address_no_zone {
    pub addr: in6_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_ipv6_address_no_zone"]
        [::std::mem::size_of::<lyd_value_ipv6_address_no_zone>() - 16usize];
    ["Alignment of lyd_value_ipv6_address_no_zone"]
        [::std::mem::align_of::<lyd_value_ipv6_address_no_zone>() - 4usize];
    ["Offset of field: lyd_value_ipv6_address_no_zone::addr"]
        [::std::mem::offset_of!(lyd_value_ipv6_address_no_zone, addr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_value_ipv6_address {
    pub addr: in6_addr,
    pub zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_ipv6_address"][::std::mem::size_of::<lyd_value_ipv6_address>() - 24usize];
    ["Alignment of lyd_value_ipv6_address"]
        [::std::mem::align_of::<lyd_value_ipv6_address>() - 8usize];
    ["Offset of field: lyd_value_ipv6_address::addr"]
        [::std::mem::offset_of!(lyd_value_ipv6_address, addr) - 0usize];
    ["Offset of field: lyd_value_ipv6_address::zone"]
        [::std::mem::offset_of!(lyd_value_ipv6_address, zone) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_value_ipv6_prefix {
    pub addr: in6_addr,
    pub prefix: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_ipv6_prefix"][::std::mem::size_of::<lyd_value_ipv6_prefix>() - 20usize];
    ["Alignment of lyd_value_ipv6_prefix"]
        [::std::mem::align_of::<lyd_value_ipv6_prefix>() - 4usize];
    ["Offset of field: lyd_value_ipv6_prefix::addr"]
        [::std::mem::offset_of!(lyd_value_ipv6_prefix, addr) - 0usize];
    ["Offset of field: lyd_value_ipv6_prefix::prefix"]
        [::std::mem::offset_of!(lyd_value_ipv6_prefix, prefix) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_date_and_time {
    pub time: time_t,
    pub fractions_s: *mut ::std::os::raw::c_char,
    pub unknown_tz: ly_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_date_and_time"][::std::mem::size_of::<lyd_value_date_and_time>() - 24usize];
    ["Alignment of lyd_value_date_and_time"]
        [::std::mem::align_of::<lyd_value_date_and_time>() - 8usize];
    ["Offset of field: lyd_value_date_and_time::time"]
        [::std::mem::offset_of!(lyd_value_date_and_time, time) - 0usize];
    ["Offset of field: lyd_value_date_and_time::fractions_s"]
        [::std::mem::offset_of!(lyd_value_date_and_time, fractions_s) - 8usize];
    ["Offset of field: lyd_value_date_and_time::unknown_tz"]
        [::std::mem::offset_of!(lyd_value_date_and_time, unknown_tz) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_date {
    pub time: time_t,
    pub unknown_tz: ly_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_date"][::std::mem::size_of::<lyd_value_date>() - 16usize];
    ["Alignment of lyd_value_date"][::std::mem::align_of::<lyd_value_date>() - 8usize];
    ["Offset of field: lyd_value_date::time"]
        [::std::mem::offset_of!(lyd_value_date, time) - 0usize];
    ["Offset of field: lyd_value_date::unknown_tz"]
        [::std::mem::offset_of!(lyd_value_date, unknown_tz) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_date_nz {
    pub time: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_date_nz"][::std::mem::size_of::<lyd_value_date_nz>() - 8usize];
    ["Alignment of lyd_value_date_nz"][::std::mem::align_of::<lyd_value_date_nz>() - 8usize];
    ["Offset of field: lyd_value_date_nz::time"]
        [::std::mem::offset_of!(lyd_value_date_nz, time) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_time {
    pub seconds: u32,
    pub fractions_s: *mut ::std::os::raw::c_char,
    pub unknown_tz: ly_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_time"][::std::mem::size_of::<lyd_value_time>() - 24usize];
    ["Alignment of lyd_value_time"][::std::mem::align_of::<lyd_value_time>() - 8usize];
    ["Offset of field: lyd_value_time::seconds"]
        [::std::mem::offset_of!(lyd_value_time, seconds) - 0usize];
    ["Offset of field: lyd_value_time::fractions_s"]
        [::std::mem::offset_of!(lyd_value_time, fractions_s) - 8usize];
    ["Offset of field: lyd_value_time::unknown_tz"]
        [::std::mem::offset_of!(lyd_value_time, unknown_tz) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_time_nz {
    pub seconds: u32,
    pub fractions_s: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_time_nz"][::std::mem::size_of::<lyd_value_time_nz>() - 16usize];
    ["Alignment of lyd_value_time_nz"][::std::mem::align_of::<lyd_value_time_nz>() - 8usize];
    ["Offset of field: lyd_value_time_nz::seconds"]
        [::std::mem::offset_of!(lyd_value_time_nz, seconds) - 0usize];
    ["Offset of field: lyd_value_time_nz::fractions_s"]
        [::std::mem::offset_of!(lyd_value_time_nz, fractions_s) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_xpath10 {
    pub exp: *mut lyxp_expr,
    pub ctx: *const ly_ctx,
    pub prefix_data: *mut ::std::os::raw::c_void,
    pub format: LY_VALUE_FORMAT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_xpath10"][::std::mem::size_of::<lyd_value_xpath10>() - 32usize];
    ["Alignment of lyd_value_xpath10"][::std::mem::align_of::<lyd_value_xpath10>() - 8usize];
    ["Offset of field: lyd_value_xpath10::exp"]
        [::std::mem::offset_of!(lyd_value_xpath10, exp) - 0usize];
    ["Offset of field: lyd_value_xpath10::ctx"]
        [::std::mem::offset_of!(lyd_value_xpath10, ctx) - 8usize];
    ["Offset of field: lyd_value_xpath10::prefix_data"]
        [::std::mem::offset_of!(lyd_value_xpath10, prefix_data) - 16usize];
    ["Offset of field: lyd_value_xpath10::format"]
        [::std::mem::offset_of!(lyd_value_xpath10, format) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_value_lyds_tree {
    pub rbt: *mut rb_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_value_lyds_tree"][::std::mem::size_of::<lyd_value_lyds_tree>() - 8usize];
    ["Alignment of lyd_value_lyds_tree"][::std::mem::align_of::<lyd_value_lyds_tree>() - 8usize];
    ["Offset of field: lyd_value_lyds_tree::rbt"]
        [::std::mem::offset_of!(lyd_value_lyds_tree, rbt) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ly_opaq_name {
    pub name: *const ::std::os::raw::c_char,
    pub prefix: *const ::std::os::raw::c_char,
    pub __bindgen_anon_1: ly_opaq_name__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ly_opaq_name__bindgen_ty_1 {
    pub module_ns: *const ::std::os::raw::c_char,
    pub module_name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ly_opaq_name__bindgen_ty_1"]
        [::std::mem::size_of::<ly_opaq_name__bindgen_ty_1>() - 8usize];
    ["Alignment of ly_opaq_name__bindgen_ty_1"]
        [::std::mem::align_of::<ly_opaq_name__bindgen_ty_1>() - 8usize];
    ["Offset of field: ly_opaq_name__bindgen_ty_1::module_ns"]
        [::std::mem::offset_of!(ly_opaq_name__bindgen_ty_1, module_ns) - 0usize];
    ["Offset of field: ly_opaq_name__bindgen_ty_1::module_name"]
        [::std::mem::offset_of!(ly_opaq_name__bindgen_ty_1, module_name) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ly_opaq_name"][::std::mem::size_of::<ly_opaq_name>() - 24usize];
    ["Alignment of ly_opaq_name"][::std::mem::align_of::<ly_opaq_name>() - 8usize];
    ["Offset of field: ly_opaq_name::name"][::std::mem::offset_of!(ly_opaq_name, name) - 0usize];
    ["Offset of field: ly_opaq_name::prefix"]
        [::std::mem::offset_of!(ly_opaq_name, prefix) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_attr {
    pub parent: *mut lyd_node_opaq,
    pub next: *mut lyd_attr,
    pub name: ly_opaq_name,
    pub value: *const ::std::os::raw::c_char,
    pub hints: u32,
    pub format: LY_VALUE_FORMAT,
    pub val_prefix_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_attr"][::std::mem::size_of::<lyd_attr>() - 64usize];
    ["Alignment of lyd_attr"][::std::mem::align_of::<lyd_attr>() - 8usize];
    ["Offset of field: lyd_attr::parent"][::std::mem::offset_of!(lyd_attr, parent) - 0usize];
    ["Offset of field: lyd_attr::next"][::std::mem::offset_of!(lyd_attr, next) - 8usize];
    ["Offset of field: lyd_attr::name"][::std::mem::offset_of!(lyd_attr, name) - 16usize];
    ["Offset of field: lyd_attr::value"][::std::mem::offset_of!(lyd_attr, value) - 40usize];
    ["Offset of field: lyd_attr::hints"][::std::mem::offset_of!(lyd_attr, hints) - 48usize];
    ["Offset of field: lyd_attr::format"][::std::mem::offset_of!(lyd_attr, format) - 52usize];
    ["Offset of field: lyd_attr::val_prefix_data"]
        [::std::mem::offset_of!(lyd_attr, val_prefix_data) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_node {
    pub hash: u32,
    pub flags: u32,
    pub schema: *const lysc_node,
    pub parent: *mut lyd_node,
    pub next: *mut lyd_node,
    pub prev: *mut lyd_node,
    pub meta: *mut lyd_meta,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node"][::std::mem::size_of::<lyd_node>() - 56usize];
    ["Alignment of lyd_node"][::std::mem::align_of::<lyd_node>() - 8usize];
    ["Offset of field: lyd_node::hash"][::std::mem::offset_of!(lyd_node, hash) - 0usize];
    ["Offset of field: lyd_node::flags"][::std::mem::offset_of!(lyd_node, flags) - 4usize];
    ["Offset of field: lyd_node::schema"][::std::mem::offset_of!(lyd_node, schema) - 8usize];
    ["Offset of field: lyd_node::parent"][::std::mem::offset_of!(lyd_node, parent) - 16usize];
    ["Offset of field: lyd_node::next"][::std::mem::offset_of!(lyd_node, next) - 24usize];
    ["Offset of field: lyd_node::prev"][::std::mem::offset_of!(lyd_node, prev) - 32usize];
    ["Offset of field: lyd_node::meta"][::std::mem::offset_of!(lyd_node, meta) - 40usize];
    ["Offset of field: lyd_node::priv_"][::std::mem::offset_of!(lyd_node, priv_) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_node_inner {
    pub __bindgen_anon_1: lyd_node_inner__bindgen_ty_1,
    pub child: *mut lyd_node,
    pub children_ht: *mut ly_ht,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lyd_node_inner__bindgen_ty_1 {
    pub node: lyd_node,
    pub __bindgen_anon_1: lyd_node_inner__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_node_inner__bindgen_ty_1__bindgen_ty_1 {
    pub hash: u32,
    pub flags: u32,
    pub schema: *const lysc_node,
    pub parent: *mut lyd_node,
    pub next: *mut lyd_node,
    pub prev: *mut lyd_node,
    pub meta: *mut lyd_meta,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_inner__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_inner__bindgen_ty_1__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_inner__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_inner__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, hash) - 0usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, flags) - 4usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::schema"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, schema) - 8usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::meta"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, meta) - 40usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1__bindgen_ty_1, priv_) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_inner__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_inner__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_inner__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_inner__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_inner__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lyd_node_inner__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_inner"][::std::mem::size_of::<lyd_node_inner>() - 72usize];
    ["Alignment of lyd_node_inner"][::std::mem::align_of::<lyd_node_inner>() - 8usize];
    ["Offset of field: lyd_node_inner::child"]
        [::std::mem::offset_of!(lyd_node_inner, child) - 56usize];
    ["Offset of field: lyd_node_inner::children_ht"]
        [::std::mem::offset_of!(lyd_node_inner, children_ht) - 64usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_node_term {
    pub __bindgen_anon_1: lyd_node_term__bindgen_ty_1,
    pub value: lyd_value,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lyd_node_term__bindgen_ty_1 {
    pub node: lyd_node,
    pub __bindgen_anon_1: lyd_node_term__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_node_term__bindgen_ty_1__bindgen_ty_1 {
    pub hash: u32,
    pub flags: u32,
    pub schema: *const lysc_node,
    pub parent: *mut lyd_node,
    pub next: *mut lyd_node,
    pub prev: *mut lyd_node,
    pub meta: *mut lyd_meta,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_term__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_term__bindgen_ty_1__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_term__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_term__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, hash) - 0usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, flags) - 4usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::schema"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, schema) - 8usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::meta"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, meta) - 40usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1__bindgen_ty_1, priv_) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_term__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_term__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_term__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_term__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_term__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lyd_node_term__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_term"][::std::mem::size_of::<lyd_node_term>() - 96usize];
    ["Alignment of lyd_node_term"][::std::mem::align_of::<lyd_node_term>() - 8usize];
    ["Offset of field: lyd_node_term::value"]
        [::std::mem::offset_of!(lyd_node_term, value) - 56usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_node_any {
    pub __bindgen_anon_1: lyd_node_any__bindgen_ty_1,
    pub child: *mut lyd_node,
    pub children_ht: *mut ly_ht,
    pub value: *const ::std::os::raw::c_char,
    pub hints: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lyd_node_any__bindgen_ty_1 {
    pub node: lyd_node,
    pub __bindgen_anon_1: lyd_node_any__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_node_any__bindgen_ty_1__bindgen_ty_1 {
    pub hash: u32,
    pub flags: u32,
    pub schema: *const lysc_node,
    pub parent: *mut lyd_node,
    pub next: *mut lyd_node,
    pub prev: *mut lyd_node,
    pub meta: *mut lyd_meta,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_any__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_any__bindgen_ty_1__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_any__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_any__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, hash) - 0usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, flags) - 4usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::schema"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, schema) - 8usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::meta"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, meta) - 40usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1__bindgen_ty_1, priv_) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_any__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_any__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_any__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_any__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_any__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lyd_node_any__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_any"][::std::mem::size_of::<lyd_node_any>() - 88usize];
    ["Alignment of lyd_node_any"][::std::mem::align_of::<lyd_node_any>() - 8usize];
    ["Offset of field: lyd_node_any::child"][::std::mem::offset_of!(lyd_node_any, child) - 56usize];
    ["Offset of field: lyd_node_any::children_ht"]
        [::std::mem::offset_of!(lyd_node_any, children_ht) - 64usize];
    ["Offset of field: lyd_node_any::value"][::std::mem::offset_of!(lyd_node_any, value) - 72usize];
    ["Offset of field: lyd_node_any::hints"][::std::mem::offset_of!(lyd_node_any, hints) - 80usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_node_opaq {
    pub __bindgen_anon_1: lyd_node_opaq__bindgen_ty_1,
    pub child: *mut lyd_node,
    pub name: ly_opaq_name,
    pub value: *const ::std::os::raw::c_char,
    pub hints: u32,
    pub format: LY_VALUE_FORMAT,
    pub val_prefix_data: *mut ::std::os::raw::c_void,
    pub attr: *mut lyd_attr,
    pub ctx: *const ly_ctx,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lyd_node_opaq__bindgen_ty_1 {
    pub node: lyd_node,
    pub __bindgen_anon_1: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_node_opaq__bindgen_ty_1__bindgen_ty_1 {
    pub hash: u32,
    pub flags: u32,
    pub schema: *const lysc_node,
    pub parent: *mut lyd_node,
    pub next: *mut lyd_node,
    pub prev: *mut lyd_node,
    pub meta: *mut lyd_meta,
    pub priv_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_opaq__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_opaq__bindgen_ty_1__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_opaq__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_opaq__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, hash) - 0usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, flags) - 4usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::schema"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, schema) - 8usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, parent) - 16usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, next) - 24usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::prev"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, prev) - 32usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::meta"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, meta) - 40usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1__bindgen_ty_1::priv_"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1__bindgen_ty_1, priv_) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_opaq__bindgen_ty_1"]
        [::std::mem::size_of::<lyd_node_opaq__bindgen_ty_1>() - 56usize];
    ["Alignment of lyd_node_opaq__bindgen_ty_1"]
        [::std::mem::align_of::<lyd_node_opaq__bindgen_ty_1>() - 8usize];
    ["Offset of field: lyd_node_opaq__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lyd_node_opaq__bindgen_ty_1, node) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_node_opaq"][::std::mem::size_of::<lyd_node_opaq>() - 128usize];
    ["Alignment of lyd_node_opaq"][::std::mem::align_of::<lyd_node_opaq>() - 8usize];
    ["Offset of field: lyd_node_opaq::child"]
        [::std::mem::offset_of!(lyd_node_opaq, child) - 56usize];
    ["Offset of field: lyd_node_opaq::name"][::std::mem::offset_of!(lyd_node_opaq, name) - 64usize];
    ["Offset of field: lyd_node_opaq::value"]
        [::std::mem::offset_of!(lyd_node_opaq, value) - 88usize];
    ["Offset of field: lyd_node_opaq::hints"]
        [::std::mem::offset_of!(lyd_node_opaq, hints) - 96usize];
    ["Offset of field: lyd_node_opaq::format"]
        [::std::mem::offset_of!(lyd_node_opaq, format) - 100usize];
    ["Offset of field: lyd_node_opaq::val_prefix_data"]
        [::std::mem::offset_of!(lyd_node_opaq, val_prefix_data) - 104usize];
    ["Offset of field: lyd_node_opaq::attr"]
        [::std::mem::offset_of!(lyd_node_opaq, attr) - 112usize];
    ["Offset of field: lyd_node_opaq::ctx"][::std::mem::offset_of!(lyd_node_opaq, ctx) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyd_leafref_links_rec {
    pub node: *const lyd_node_term,
    pub leafref_nodes: *mut *const lyd_node_term,
    pub target_nodes: *mut *const lyd_node_term,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_leafref_links_rec"][::std::mem::size_of::<lyd_leafref_links_rec>() - 24usize];
    ["Alignment of lyd_leafref_links_rec"]
        [::std::mem::align_of::<lyd_leafref_links_rec>() - 8usize];
    ["Offset of field: lyd_leafref_links_rec::node"]
        [::std::mem::offset_of!(lyd_leafref_links_rec, node) - 0usize];
    ["Offset of field: lyd_leafref_links_rec::leafref_nodes"]
        [::std::mem::offset_of!(lyd_leafref_links_rec, leafref_nodes) - 8usize];
    ["Offset of field: lyd_leafref_links_rec::target_nodes"]
        [::std::mem::offset_of!(lyd_leafref_links_rec, target_nodes) - 16usize];
};
unsafe extern "C" {
    pub fn lyd_child_no_keys(node: *const lyd_node) -> *mut lyd_node;
}
unsafe extern "C" {
    pub fn lyd_owner_module(node: *const lyd_node) -> *const lys_module;
}
unsafe extern "C" {
    pub fn lyd_node_module(node: *const lyd_node) -> *const lys_module;
}
unsafe extern "C" {
    pub fn lyd_is_default(node: *const lyd_node) -> ly_bool;
}
unsafe extern "C" {
    pub fn lyd_list_pos(instance: *const lyd_node) -> u32;
}
unsafe extern "C" {
    pub fn lyd_first_sibling(node: *const lyd_node) -> *mut lyd_node;
}
unsafe extern "C" {
    pub fn lyd_parse_opaq_error(node: *const lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_value_get_canonical(
        ctx: *const ly_ctx,
        value: *const lyd_value,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lyd_any_value_str(
        any: *const lyd_node,
        format: LYD_FORMAT,
        value_str: *mut *mut ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_any_copy_value(
        trg: *mut lyd_node,
        child: *const lyd_node,
        value: *const ::std::os::raw::c_char,
        hints: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_node_schema(node: *const lyd_node) -> *const lysc_node;
}
unsafe extern "C" {
    pub fn lyd_meta_is_internal(meta: *const lyd_meta) -> ly_bool;
}
unsafe extern "C" {
    pub fn lyd_new_inner(
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        output: ly_bool,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_list(
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        options: u32,
        node: *mut *mut lyd_node,
        ...
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_list2(
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        keys: *const ::std::os::raw::c_char,
        options: u32,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_list3(
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        key_values: *mut *const ::std::os::raw::c_void,
        value_sizes_bits: *mut u32,
        options: u32,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_term(
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        options: u32,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_any(
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        child: *const lyd_node,
        value: *const ::std::os::raw::c_char,
        hints: u32,
        options: u32,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_meta(
        ctx: *const ly_ctx,
        parent: *mut lyd_node,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
        val_str: *const ::std::os::raw::c_char,
        options: u32,
        meta: *mut *mut lyd_meta,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_meta2(
        ctx: *const ly_ctx,
        parent: *mut lyd_node,
        options: u32,
        attr: *const lyd_attr,
        meta: *mut *mut lyd_meta,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_opaq(
        parent: *mut lyd_node,
        ctx: *const ly_ctx,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        prefix: *const ::std::os::raw::c_char,
        module_name: *const ::std::os::raw::c_char,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_opaq2(
        parent: *mut lyd_node,
        ctx: *const ly_ctx,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        prefix: *const ::std::os::raw::c_char,
        module_ns: *const ::std::os::raw::c_char,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_attr(
        parent: *mut lyd_node,
        module_name: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        attr: *mut *mut lyd_attr,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_attr2(
        parent: *mut lyd_node,
        module_ns: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        attr: *mut *mut lyd_attr,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_path(
        parent: *mut lyd_node,
        ctx: *const ly_ctx,
        path: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        options: u32,
        node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_path2(
        parent: *mut lyd_node,
        ctx: *const ly_ctx,
        path: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_void,
        value_size_bits: u64,
        any_hints: u32,
        options: u32,
        new_parent: *mut *mut lyd_node,
        new_node: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_implicit_tree(
        tree: *mut lyd_node,
        implicit_options: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_implicit_all(
        tree: *mut *mut lyd_node,
        ctx: *const ly_ctx,
        implicit_options: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_new_implicit_module(
        tree: *mut *mut lyd_node,
        module: *const lys_module,
        implicit_options: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_change_term(term: *mut lyd_node, val_str: *const ::std::os::raw::c_char) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_change_term_canon(
        term: *mut lyd_node,
        val_str: *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_change_meta(meta: *mut lyd_meta, val_str: *const ::std::os::raw::c_char) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_insert_child(parent: *mut lyd_node, node: *mut lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_insert_sibling(
        sibling: *mut lyd_node,
        node: *mut lyd_node,
        first: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_insert_before(sibling: *mut lyd_node, node: *mut lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_insert_after(sibling: *mut lyd_node, node: *mut lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_unlink_siblings(node: *mut lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_unlink_tree(node: *mut lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_free_all(node: *mut lyd_node);
}
unsafe extern "C" {
    pub fn lyd_free_siblings(node: *mut lyd_node);
}
unsafe extern "C" {
    pub fn lyd_free_tree(node: *mut lyd_node);
}
unsafe extern "C" {
    pub fn lyd_free_meta_single(meta: *mut lyd_meta);
}
unsafe extern "C" {
    pub fn lyd_free_meta_siblings(meta: *mut lyd_meta);
}
unsafe extern "C" {
    pub fn lyd_free_attr_single(ctx: *const ly_ctx, attr: *mut lyd_attr);
}
unsafe extern "C" {
    pub fn lyd_free_attr_siblings(ctx: *const ly_ctx, attr: *mut lyd_attr);
}
unsafe extern "C" {
    pub fn lyd_value_validate(
        schema: *const lysc_node,
        value: *const ::std::os::raw::c_char,
        value_len: u32,
        ctx_node: *const lyd_node,
        realtype: *mut *const lysc_type,
        canonical: *mut *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_value_validate_dflt(
        schema: *const lysc_node,
        value: *const ::std::os::raw::c_char,
        prefixes: *mut lysc_prefix,
        ctx_node: *const lyd_node,
        realtype: *mut *const lysc_type,
        canonical: *mut *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_value_compare(
        node: *const lyd_node_term,
        value: *const ::std::os::raw::c_char,
        value_len: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_compare_single(
        node1: *const lyd_node,
        node2: *const lyd_node,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_compare_siblings(
        node1: *const lyd_node,
        node2: *const lyd_node,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_compare_meta(meta1: *const lyd_meta, meta2: *const lyd_meta) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_dup_single(
        node: *const lyd_node,
        parent: *mut lyd_node,
        options: u32,
        dup: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_dup_single_to_ctx(
        node: *const lyd_node,
        trg_ctx: *const ly_ctx,
        parent: *mut lyd_node,
        options: u32,
        dup: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_dup_siblings(
        node: *const lyd_node,
        parent: *mut lyd_node,
        options: u32,
        dup: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_dup_siblings_to_ctx(
        node: *const lyd_node,
        trg_ctx: *const ly_ctx,
        parent: *mut lyd_node,
        options: u32,
        dup: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_dup_meta_single(
        meta: *const lyd_meta,
        parent: *mut lyd_node,
        dup: *mut *mut lyd_meta,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_merge_tree(
        target: *mut *mut lyd_node,
        source: *const lyd_node,
        options: u16,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_merge_siblings(
        target: *mut *mut lyd_node,
        source: *const lyd_node,
        options: u16,
    ) -> LY_ERR;
}
pub type lyd_merge_cb = ::std::option::Option<
    unsafe extern "C" fn(
        trg_node: *mut lyd_node,
        src_node: *const lyd_node,
        cb_data: *mut ::std::os::raw::c_void,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn lyd_merge_module(
        target: *mut *mut lyd_node,
        source: *const lyd_node,
        mod_: *const lys_module,
        merge_cb: lyd_merge_cb,
        cb_data: *mut ::std::os::raw::c_void,
        options: u16,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_tree(
        first: *const lyd_node,
        second: *const lyd_node,
        options: u16,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_siblings(
        first: *const lyd_node,
        second: *const lyd_node,
        options: u16,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
pub type lyd_diff_cb = ::std::option::Option<
    unsafe extern "C" fn(
        diff_node: *const lyd_node,
        data_node: *mut lyd_node,
        cb_data: *mut ::std::os::raw::c_void,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn lyd_diff_apply_module(
        data: *mut *mut lyd_node,
        diff: *const lyd_node,
        mod_: *const lys_module,
        diff_cb: lyd_diff_cb,
        cb_data: *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_apply_all(data: *mut *mut lyd_node, diff: *const lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_merge_module(
        diff: *mut *mut lyd_node,
        src_diff: *const lyd_node,
        mod_: *const lys_module,
        diff_cb: lyd_diff_cb,
        cb_data: *mut ::std::os::raw::c_void,
        options: u16,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_merge_tree(
        diff_first: *mut *mut lyd_node,
        diff_parent: *mut lyd_node,
        src_sibling: *const lyd_node,
        diff_cb: lyd_diff_cb,
        cb_data: *mut ::std::os::raw::c_void,
        options: u16,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_merge_all(
        diff: *mut *mut lyd_node,
        src_diff: *const lyd_node,
        options: u16,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_diff_reverse_all(src_diff: *const lyd_node, diff: *mut *mut lyd_node) -> LY_ERR;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LYD_PATH_TYPE {
    LYD_PATH_STD = 0,
    LYD_PATH_STD_NO_LAST_PRED = 1,
}
unsafe extern "C" {
    pub fn lyd_path(
        node: *const lyd_node,
        pathtype: LYD_PATH_TYPE,
        buffer: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lyd_find_meta(
        first: *const lyd_meta,
        module: *const lys_module,
        name: *const ::std::os::raw::c_char,
    ) -> *mut lyd_meta;
}
unsafe extern "C" {
    pub fn lyd_find_sibling_first(
        siblings: *const lyd_node,
        target: *const lyd_node,
        match_: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_sibling_val(
        siblings: *const lyd_node,
        schema: *const lysc_node,
        key_or_value: *const ::std::os::raw::c_char,
        val_len: u32,
        match_: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_sibling_dup_inst_set(
        siblings: *const lyd_node,
        target: *const lyd_node,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_sibling_opaq_next(
        first: *const lyd_node,
        name: *const ::std::os::raw::c_char,
        match_: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyxp_vars_set(
        vars: *mut *mut lyxp_var,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyxp_vars_free(vars: *mut lyxp_var);
}
unsafe extern "C" {
    pub fn lyd_find_xpath(
        ctx_node: *const lyd_node,
        xpath: *const ::std::os::raw::c_char,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_xpath2(
        ctx_node: *const lyd_node,
        xpath: *const ::std::os::raw::c_char,
        vars: *const lyxp_var,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_xpath3(
        ctx_node: *const lyd_node,
        tree: *const lyd_node,
        xpath: *const ::std::os::raw::c_char,
        format: LY_VALUE_FORMAT,
        prefix_data: *mut ::std::os::raw::c_void,
        vars: *const lyxp_var,
        set: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_eval_xpath(
        ctx_node: *const lyd_node,
        xpath: *const ::std::os::raw::c_char,
        result: *mut ly_bool,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_eval_xpath2(
        ctx_node: *const lyd_node,
        xpath: *const ::std::os::raw::c_char,
        vars: *const lyxp_var,
        result: *mut ly_bool,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_eval_xpath3(
        ctx_node: *const lyd_node,
        cur_mod: *const lys_module,
        xpath: *const ::std::os::raw::c_char,
        format: LY_VALUE_FORMAT,
        prefix_data: *mut ::std::os::raw::c_void,
        vars: *const lyxp_var,
        result: *mut ly_bool,
    ) -> LY_ERR;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_XPATH_TYPE {
    LY_XPATH_NODE_SET = 0,
    LY_XPATH_STRING = 1,
    LY_XPATH_NUMBER = 2,
    LY_XPATH_BOOLEAN = 3,
}
unsafe extern "C" {
    pub fn lyd_eval_xpath4(
        ctx_node: *const lyd_node,
        tree: *const lyd_node,
        cur_mod: *const lys_module,
        xpath: *const ::std::os::raw::c_char,
        format: LY_VALUE_FORMAT,
        prefix_data: *mut ::std::os::raw::c_void,
        vars: *const lyxp_var,
        ret_type: *mut LY_XPATH_TYPE,
        node_set: *mut *mut ly_set,
        string: *mut *mut ::std::os::raw::c_char,
        number: *mut f64,
        boolean: *mut ly_bool,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_trim_xpath(
        tree: *mut *mut lyd_node,
        xpath: *const ::std::os::raw::c_char,
        vars: *const lyxp_var,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_path(
        ctx_node: *const lyd_node,
        path: *const ::std::os::raw::c_char,
        output: ly_bool,
        match_: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_find_target(
        path: *const ly_path,
        tree: *const lyd_node,
        match_: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_time_tz_offset() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ly_time_tz_offset_at(time: time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ly_time_str2time(
        value: *const ::std::os::raw::c_char,
        time: *mut time_t,
        fractions_s: *mut *mut ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_time_time2str(
        time: time_t,
        fractions_s: *const ::std::os::raw::c_char,
        str_: *mut *mut ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_time_str2ts(value: *const ::std::os::raw::c_char, ts: *mut timespec) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_time_ts2str(ts: *const timespec, str_: *mut *mut ::std::os::raw::c_char) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_leafref_get_links(
        node: *const lyd_node_term,
        record: *mut *const lyd_leafref_links_rec,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_leafref_link_node_tree(tree: *const lyd_node) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_pattern_match(
        ctx: *const ly_ctx,
        pattern: *const ::std::os::raw::c_char,
        string: *const ::std::os::raw::c_char,
        str_len: u32,
        pat_comp: *mut *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_pattern_compile(
        ctx: *const ly_ctx,
        pattern: *const ::std::os::raw::c_char,
        pat_comp: *mut *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_pattern_free(pat_comp: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn ly_ctx_new(
        search_dir: *const ::std::os::raw::c_char,
        options: u32,
        new_ctx: *mut *mut ly_ctx,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_new_ylpath(
        search_dir: *const ::std::os::raw::c_char,
        path: *const ::std::os::raw::c_char,
        format: LYD_FORMAT,
        options: ::std::os::raw::c_int,
        ctx: *mut *mut ly_ctx,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_new_ylmem(
        search_dir: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_char,
        format: LYD_FORMAT,
        options: ::std::os::raw::c_int,
        ctx: *mut *mut ly_ctx,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_new_yldata(
        search_dir: *const ::std::os::raw::c_char,
        tree: *const lyd_node,
        options: ::std::os::raw::c_int,
        ctx: *mut *mut ly_ctx,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_compile(ctx: *mut ly_ctx) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_set_searchdir(
        ctx: *mut ly_ctx,
        search_dir: *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_unset_searchdir(ctx: *mut ly_ctx, value: *const ::std::os::raw::c_char)
        -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_unset_searchdir_last(ctx: *mut ly_ctx, count: u32) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_get_searchdirs(ctx: *const ly_ctx) -> *const *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_ctx_get_options(ctx: *const ly_ctx) -> u32;
}
unsafe extern "C" {
    pub fn ly_ctx_set_options(ctx: *mut ly_ctx, option: u32) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_unset_options(ctx: *mut ly_ctx, option: u32) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_get_change_count(ctx: *const ly_ctx) -> u16;
}
unsafe extern "C" {
    pub fn ly_ctx_get_modules_hash(ctx: *const ly_ctx) -> u32;
}
pub type ly_module_imp_data_free_clb = ::std::option::Option<
    unsafe extern "C" fn(
        module_data: *mut ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type ly_module_imp_clb = ::std::option::Option<
    unsafe extern "C" fn(
        mod_name: *const ::std::os::raw::c_char,
        mod_rev: *const ::std::os::raw::c_char,
        submod_name: *const ::std::os::raw::c_char,
        submod_rev: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
        format: *mut LYS_INFORMAT,
        module_data: *mut *const ::std::os::raw::c_char,
        free_module_data: *mut ly_module_imp_data_free_clb,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn ly_ctx_get_module_imp_clb(
        ctx: *const ly_ctx,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ly_module_imp_clb;
}
unsafe extern "C" {
    pub fn ly_ctx_set_module_imp_clb(
        ctx: *mut ly_ctx,
        clb: ly_module_imp_clb,
        user_data: *mut ::std::os::raw::c_void,
    );
}
pub type ly_ext_data_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ext: *const lysc_ext_instance,
        parent: *const lyd_node,
        user_data: *mut ::std::os::raw::c_void,
        ext_data: *mut *mut ::std::os::raw::c_void,
        ext_data_free: *mut ly_bool,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn ly_ctx_set_ext_data_clb(
        ctx: *const ly_ctx,
        clb: ly_ext_data_clb,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ly_ext_data_clb;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module(
        ctx: *const ly_ctx,
        name: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module_latest(
        ctx: *const ly_ctx,
        name: *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module_implemented(
        ctx: *const ly_ctx,
        name: *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module_iter(ctx: *const ly_ctx, index: *mut u32) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module_ns(
        ctx: *const ly_ctx,
        ns: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module_latest_ns(
        ctx: *const ly_ctx,
        ns: *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_module_implemented_ns(
        ctx: *const ly_ctx,
        ns: *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_submodule(
        ctx: *const ly_ctx,
        submodule: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
    ) -> *const lysp_submodule;
}
unsafe extern "C" {
    pub fn ly_ctx_get_submodule_latest(
        ctx: *const ly_ctx,
        submodule: *const ::std::os::raw::c_char,
    ) -> *const lysp_submodule;
}
unsafe extern "C" {
    pub fn ly_ctx_get_submodule2(
        module: *const lys_module,
        submodule: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
    ) -> *const lysp_submodule;
}
unsafe extern "C" {
    pub fn ly_ctx_get_submodule2_latest(
        module: *const lys_module,
        submodule: *const ::std::os::raw::c_char,
    ) -> *const lysp_submodule;
}
unsafe extern "C" {
    pub fn ly_ctx_internal_modules_count(ctx: *const ly_ctx) -> u32;
}
unsafe extern "C" {
    pub fn ly_ctx_load_module(
        ctx: *mut ly_ctx,
        name: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
        features: *mut *const ::std::os::raw::c_char,
    ) -> *mut lys_module;
}
unsafe extern "C" {
    pub fn ly_ctx_get_yanglib_data(
        ctx: *const ly_ctx,
        root: *mut *mut lyd_node,
        content_id_format: *const ::std::os::raw::c_char,
        ...
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_free_parsed(ctx: *mut ly_ctx);
}
unsafe extern "C" {
    pub fn ly_ctx_compiled_size(ctx: *const ly_ctx) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ly_ctx_compiled_print(
        ctx: *const ly_ctx,
        mem: *mut ::std::os::raw::c_void,
        mem_end: *mut *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_new_printed(mem: *const ::std::os::raw::c_void, ctx: *mut *mut ly_ctx) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_ctx_is_printed(ctx: *const ly_ctx) -> ly_bool;
}
unsafe extern "C" {
    pub fn ly_ctx_destroy(ctx: *mut ly_ctx);
}
unsafe extern "C" {
    pub fn lydict_insert(
        ctx: *const ly_ctx,
        value: *const ::std::os::raw::c_char,
        len: usize,
        str_p: *mut *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lydict_insert_zc(
        ctx: *const ly_ctx,
        value: *mut ::std::os::raw::c_char,
        str_p: *mut *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lydict_remove(ctx: *const ly_ctx, value: *const ::std::os::raw::c_char) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lydict_dup(
        ctx: *const ly_ctx,
        value: *const ::std::os::raw::c_char,
        str_p: *mut *const ::std::os::raw::c_char,
    ) -> LY_ERR;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_IN_TYPE {
    LY_IN_ERROR = -1,
    LY_IN_FD = 0,
    LY_IN_FILE = 1,
    LY_IN_FILEPATH = 2,
    LY_IN_MEMORY = 3,
}
unsafe extern "C" {
    pub fn ly_in_type(in_: *const ly_in) -> LY_IN_TYPE;
}
unsafe extern "C" {
    pub fn ly_in_reset(in_: *mut ly_in) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_new_fd(fd: ::std::os::raw::c_int, in_: *mut *mut ly_in) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_fd(in_: *mut ly_in, fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ly_in_new_file(f: *mut FILE, in_: *mut *mut ly_in) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_file(in_: *mut ly_in, f: *mut FILE) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ly_in_new_memory(str_: *const ::std::os::raw::c_char, in_: *mut *mut ly_in) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_memory(
        in_: *mut ly_in,
        str_: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_in_new_filepath(
        filepath: *const ::std::os::raw::c_char,
        len: usize,
        in_: *mut *mut ly_in,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_filepath(
        in_: *mut ly_in,
        filepath: *const ::std::os::raw::c_char,
        len: usize,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_in_parsed(in_: *const ly_in) -> usize;
}
unsafe extern "C" {
    pub fn ly_in_free(in_: *mut ly_in, destroy: ly_bool);
}
unsafe extern "C" {
    pub fn ly_in_read(in_: *mut ly_in, buf: *mut ::std::os::raw::c_void, count: usize) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_peek(in_: *mut ly_in, peek: *mut u8) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_in_skip(in_: *mut ly_in, count: usize) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_parse_data(
        ctx: *const ly_ctx,
        parent: *mut lyd_node,
        in_: *mut ly_in,
        format: LYD_FORMAT,
        parse_options: u32,
        validate_options: u32,
        tree: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_parse_data_mem(
        ctx: *const ly_ctx,
        data: *const ::std::os::raw::c_char,
        format: LYD_FORMAT,
        parse_options: u32,
        validate_options: u32,
        tree: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_parse_data_fd(
        ctx: *const ly_ctx,
        fd: ::std::os::raw::c_int,
        format: LYD_FORMAT,
        parse_options: u32,
        validate_options: u32,
        tree: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_parse_data_path(
        ctx: *const ly_ctx,
        path: *const ::std::os::raw::c_char,
        format: LYD_FORMAT,
        parse_options: u32,
        validate_options: u32,
        tree: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_parse_value_fragment(
        ctx: *const ly_ctx,
        path: *const ::std::os::raw::c_char,
        in_: *mut ly_in,
        format: LYD_FORMAT,
        new_val_options: u32,
        parse_options: u32,
        validate_options: u32,
        tree: *mut *mut lyd_node,
    ) -> LY_ERR;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lyd_type {
    LYD_TYPE_DATA_YANG = 0,
    LYD_TYPE_RPC_YANG = 1,
    LYD_TYPE_NOTIF_YANG = 2,
    LYD_TYPE_REPLY_YANG = 3,
    LYD_TYPE_RPC_NETCONF = 4,
    LYD_TYPE_NOTIF_NETCONF = 5,
    LYD_TYPE_REPLY_NETCONF = 6,
    LYD_TYPE_RPC_RESTCONF = 7,
    LYD_TYPE_NOTIF_RESTCONF = 8,
    LYD_TYPE_REPLY_RESTCONF = 9,
}
unsafe extern "C" {
    pub fn lyd_parse_op(
        ctx: *const ly_ctx,
        parent: *mut lyd_node,
        in_: *mut ly_in,
        format: LYD_FORMAT,
        data_type: lyd_type,
        parse_options: u32,
        tree: *mut *mut lyd_node,
        op: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_validate_ext(
        ext_tree: *mut *mut lyd_node,
        ext: *const lysc_ext_instance,
        val_opts: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_validate_all(
        tree: *mut *mut lyd_node,
        ctx: *const ly_ctx,
        val_opts: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_validate_module(
        tree: *mut *mut lyd_node,
        module: *const lys_module,
        val_opts: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_validate_module_final(
        tree: *mut lyd_node,
        module: *const lys_module,
        val_opts: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_validate_op(
        op_tree: *mut lyd_node,
        dep_tree: *const lyd_node,
        data_type: lyd_type,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyplg_type_record {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn lyplg_add(pathname: *const ::std::os::raw::c_char) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_add_extension_plugin(
        ctx: *mut ly_ctx,
        version: u32,
        recs: *const lyplg_ext_record,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_add_type_plugin(
        ctx: *mut ly_ctx,
        version: u32,
        recs: *const lyplg_type_record,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_realloc(ptr: *mut ::std::os::raw::c_void, size: usize)
        -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_ctx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ctx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyspr_ctx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyspr_tree_ctx {
    _unused: [u8; 0],
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ly_stmt {
    LY_STMT_NONE = 0,
    LY_STMT_NOTIFICATION = 1,
    LY_STMT_INPUT = 2,
    LY_STMT_OUTPUT = 4,
    LY_STMT_ACTION = 8,
    LY_STMT_RPC = 16,
    LY_STMT_ANYDATA = 32,
    LY_STMT_ANYXML = 64,
    LY_STMT_AUGMENT = 128,
    LY_STMT_CASE = 256,
    LY_STMT_CHOICE = 512,
    LY_STMT_CONTAINER = 1024,
    LY_STMT_GROUPING = 2048,
    LY_STMT_LEAF = 4096,
    LY_STMT_LEAF_LIST = 8192,
    LY_STMT_LIST = 16384,
    LY_STMT_USES = 32768,
    LY_STMT_ARGUMENT = 65536,
    LY_STMT_BASE = 131072,
    LY_STMT_BELONGS_TO = 196608,
    LY_STMT_BIT = 262144,
    LY_STMT_CONFIG = 327680,
    LY_STMT_CONTACT = 393216,
    LY_STMT_DEFAULT = 458752,
    LY_STMT_DESCRIPTION = 524288,
    LY_STMT_DEVIATE = 589824,
    LY_STMT_DEVIATION = 655360,
    LY_STMT_ENUM = 720896,
    LY_STMT_ERROR_APP_TAG = 786432,
    LY_STMT_ERROR_MESSAGE = 851968,
    LY_STMT_EXTENSION = 917504,
    LY_STMT_EXTENSION_INSTANCE = 983040,
    LY_STMT_FEATURE = 1048576,
    LY_STMT_FRACTION_DIGITS = 1114112,
    LY_STMT_IDENTITY = 1179648,
    LY_STMT_IF_FEATURE = 1245184,
    LY_STMT_IMPORT = 1310720,
    LY_STMT_INCLUDE = 1376256,
    LY_STMT_KEY = 1441792,
    LY_STMT_LENGTH = 1507328,
    LY_STMT_MANDATORY = 1572864,
    LY_STMT_MAX_ELEMENTS = 1638400,
    LY_STMT_MIN_ELEMENTS = 1703936,
    LY_STMT_MODIFIER = 1769472,
    LY_STMT_MODULE = 1835008,
    LY_STMT_MUST = 1900544,
    LY_STMT_NAMESPACE = 1966080,
    LY_STMT_ORDERED_BY = 2031616,
    LY_STMT_ORGANIZATION = 2097152,
    LY_STMT_PATH = 2162688,
    LY_STMT_PATTERN = 2228224,
    LY_STMT_POSITION = 2293760,
    LY_STMT_PREFIX = 2359296,
    LY_STMT_PRESENCE = 2424832,
    LY_STMT_RANGE = 2490368,
    LY_STMT_REFERENCE = 2555904,
    LY_STMT_REFINE = 2621440,
    LY_STMT_REQUIRE_INSTANCE = 2686976,
    LY_STMT_REVISION = 2752512,
    LY_STMT_REVISION_DATE = 2818048,
    LY_STMT_STATUS = 2883584,
    LY_STMT_SUBMODULE = 2949120,
    LY_STMT_TYPE = 3014656,
    LY_STMT_TYPEDEF = 3080192,
    LY_STMT_UNIQUE = 3145728,
    LY_STMT_UNITS = 3211264,
    LY_STMT_VALUE = 3276800,
    LY_STMT_WHEN = 3342336,
    LY_STMT_YANG_VERSION = 3407872,
    LY_STMT_YIN_ELEMENT = 3473408,
    LY_STMT_SYNTAX_SEMICOLON = 3473409,
    LY_STMT_SYNTAX_LEFT_BRACE = 3473410,
    LY_STMT_SYNTAX_RIGHT_BRACE = 3473411,
    LY_STMT_ARG_TEXT = 3473412,
    LY_STMT_ARG_VALUE = 3473413,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_stmt {
    pub stmt: *const ::std::os::raw::c_char,
    pub arg: *const ::std::os::raw::c_char,
    pub format: LY_VALUE_FORMAT,
    pub prefix_data: *mut ::std::os::raw::c_void,
    pub next: *mut lysp_stmt,
    pub child: *mut lysp_stmt,
    pub flags: u16,
    pub kw: ly_stmt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_stmt"][::std::mem::size_of::<lysp_stmt>() - 56usize];
    ["Alignment of lysp_stmt"][::std::mem::align_of::<lysp_stmt>() - 8usize];
    ["Offset of field: lysp_stmt::stmt"][::std::mem::offset_of!(lysp_stmt, stmt) - 0usize];
    ["Offset of field: lysp_stmt::arg"][::std::mem::offset_of!(lysp_stmt, arg) - 8usize];
    ["Offset of field: lysp_stmt::format"][::std::mem::offset_of!(lysp_stmt, format) - 16usize];
    ["Offset of field: lysp_stmt::prefix_data"]
        [::std::mem::offset_of!(lysp_stmt, prefix_data) - 24usize];
    ["Offset of field: lysp_stmt::next"][::std::mem::offset_of!(lysp_stmt, next) - 32usize];
    ["Offset of field: lysp_stmt::child"][::std::mem::offset_of!(lysp_stmt, child) - 40usize];
    ["Offset of field: lysp_stmt::flags"][::std::mem::offset_of!(lysp_stmt, flags) - 48usize];
    ["Offset of field: lysp_stmt::kw"][::std::mem::offset_of!(lysp_stmt, kw) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ext_substmt {
    pub stmt: ly_stmt,
    pub storage_p: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_ext_substmt"][::std::mem::size_of::<lysp_ext_substmt>() - 16usize];
    ["Alignment of lysp_ext_substmt"][::std::mem::align_of::<lysp_ext_substmt>() - 8usize];
    ["Offset of field: lysp_ext_substmt::stmt"]
        [::std::mem::offset_of!(lysp_ext_substmt, stmt) - 0usize];
    ["Offset of field: lysp_ext_substmt::storage_p"]
        [::std::mem::offset_of!(lysp_ext_substmt, storage_p) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ext_instance {
    pub name: *const ::std::os::raw::c_char,
    pub argument: *const ::std::os::raw::c_char,
    pub format: LY_VALUE_FORMAT,
    pub prefix_data: *mut ::std::os::raw::c_void,
    pub plugin_ref: usize,
    pub parent: *mut ::std::os::raw::c_void,
    pub parent_stmt: ly_stmt,
    pub parent_stmt_index: u64,
    pub flags: u16,
    pub substmts: *mut lysp_ext_substmt,
    pub parsed: *mut ::std::os::raw::c_void,
    pub child: *mut lysp_stmt,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_ext_instance"][::std::mem::size_of::<lysp_ext_instance>() - 104usize];
    ["Alignment of lysp_ext_instance"][::std::mem::align_of::<lysp_ext_instance>() - 8usize];
    ["Offset of field: lysp_ext_instance::name"]
        [::std::mem::offset_of!(lysp_ext_instance, name) - 0usize];
    ["Offset of field: lysp_ext_instance::argument"]
        [::std::mem::offset_of!(lysp_ext_instance, argument) - 8usize];
    ["Offset of field: lysp_ext_instance::format"]
        [::std::mem::offset_of!(lysp_ext_instance, format) - 16usize];
    ["Offset of field: lysp_ext_instance::prefix_data"]
        [::std::mem::offset_of!(lysp_ext_instance, prefix_data) - 24usize];
    ["Offset of field: lysp_ext_instance::plugin_ref"]
        [::std::mem::offset_of!(lysp_ext_instance, plugin_ref) - 32usize];
    ["Offset of field: lysp_ext_instance::parent"]
        [::std::mem::offset_of!(lysp_ext_instance, parent) - 40usize];
    ["Offset of field: lysp_ext_instance::parent_stmt"]
        [::std::mem::offset_of!(lysp_ext_instance, parent_stmt) - 48usize];
    ["Offset of field: lysp_ext_instance::parent_stmt_index"]
        [::std::mem::offset_of!(lysp_ext_instance, parent_stmt_index) - 56usize];
    ["Offset of field: lysp_ext_instance::flags"]
        [::std::mem::offset_of!(lysp_ext_instance, flags) - 64usize];
    ["Offset of field: lysp_ext_instance::substmts"]
        [::std::mem::offset_of!(lysp_ext_instance, substmts) - 72usize];
    ["Offset of field: lysp_ext_instance::parsed"]
        [::std::mem::offset_of!(lysp_ext_instance, parsed) - 80usize];
    ["Offset of field: lysp_ext_instance::child"]
        [::std::mem::offset_of!(lysp_ext_instance, child) - 88usize];
    ["Offset of field: lysp_ext_instance::exts"]
        [::std::mem::offset_of!(lysp_ext_instance, exts) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_ext_substmt {
    pub stmt: ly_stmt,
    pub storage_p: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_ext_substmt"][::std::mem::size_of::<lysc_ext_substmt>() - 16usize];
    ["Alignment of lysc_ext_substmt"][::std::mem::align_of::<lysc_ext_substmt>() - 8usize];
    ["Offset of field: lysc_ext_substmt::stmt"]
        [::std::mem::offset_of!(lysc_ext_substmt, stmt) - 0usize];
    ["Offset of field: lysc_ext_substmt::storage_p"]
        [::std::mem::offset_of!(lysc_ext_substmt, storage_p) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_ext_instance {
    pub def: *mut lysc_ext,
    pub argument: *const ::std::os::raw::c_char,
    pub module: *mut lys_module,
    pub exts: *mut lysc_ext_instance,
    pub parent: *mut ::std::os::raw::c_void,
    pub parent_stmt: ly_stmt,
    pub parent_stmt_index: u64,
    pub substmts: *mut lysc_ext_substmt,
    pub compiled: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_ext_instance"][::std::mem::size_of::<lysc_ext_instance>() - 72usize];
    ["Alignment of lysc_ext_instance"][::std::mem::align_of::<lysc_ext_instance>() - 8usize];
    ["Offset of field: lysc_ext_instance::def"]
        [::std::mem::offset_of!(lysc_ext_instance, def) - 0usize];
    ["Offset of field: lysc_ext_instance::argument"]
        [::std::mem::offset_of!(lysc_ext_instance, argument) - 8usize];
    ["Offset of field: lysc_ext_instance::module"]
        [::std::mem::offset_of!(lysc_ext_instance, module) - 16usize];
    ["Offset of field: lysc_ext_instance::exts"]
        [::std::mem::offset_of!(lysc_ext_instance, exts) - 24usize];
    ["Offset of field: lysc_ext_instance::parent"]
        [::std::mem::offset_of!(lysc_ext_instance, parent) - 32usize];
    ["Offset of field: lysc_ext_instance::parent_stmt"]
        [::std::mem::offset_of!(lysc_ext_instance, parent_stmt) - 40usize];
    ["Offset of field: lysc_ext_instance::parent_stmt_index"]
        [::std::mem::offset_of!(lysc_ext_instance, parent_stmt_index) - 48usize];
    ["Offset of field: lysc_ext_instance::substmts"]
        [::std::mem::offset_of!(lysc_ext_instance, substmts) - 56usize];
    ["Offset of field: lysc_ext_instance::compiled"]
        [::std::mem::offset_of!(lysc_ext_instance, compiled) - 64usize];
};
pub type lyplg_ext_parse_clb = ::std::option::Option<
    unsafe extern "C" fn(pctx: *mut lysp_ctx, ext: *mut lysp_ext_instance) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn lyplg_ext_parse_log(
        pctx: *const lysp_ctx,
        ext: *const lysp_ext_instance,
        level: LY_LOG_LEVEL,
        err: LY_ERR,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn lyplg_ext_parse_get_cur_pmod(pctx: *const lysp_ctx) -> *const lysp_module;
}
unsafe extern "C" {
    pub fn lyplg_ext_parse_extension_instance(
        pctx: *mut lysp_ctx,
        ext: *mut lysp_ext_instance,
    ) -> LY_ERR;
}
pub type lyplg_ext_compile_clb = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut lysc_ctx,
        extp: *const lysp_ext_instance,
        ext: *mut lysc_ext_instance,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn lyplg_ext_compile_log(
        cctx: *const lysc_ctx,
        ext: *const lysc_ext_instance,
        level: LY_LOG_LEVEL,
        err: LY_ERR,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_log_path(
        path: *const ::std::os::raw::c_char,
        ext: *const lysc_ext_instance,
        level: LY_LOG_LEVEL,
        err: LY_ERR,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_log_err(eitem: *const ly_err_item, ext: *const lysc_ext_instance);
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_get_ctx(ctx: *const lysc_ctx) -> *mut ly_ctx;
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_get_options(ctx: *const lysc_ctx) -> *mut u32;
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_get_cur_mod(ctx: *const lysc_ctx) -> *const lys_module;
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_get_pmod(ctx: *const lysc_ctx) -> *mut lysp_module;
}
unsafe extern "C" {
    pub fn lyplg_ext_compile_extension_instance(
        ctx: *mut lysc_ctx,
        extp: *const lysp_ext_instance,
        ext: *mut lysc_ext_instance,
        parent: *mut lysc_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_compiled_node_augments(
        ctx: *mut lysc_ctx,
        ext: *mut lysc_ext_instance,
        node: *mut lysc_node,
    ) -> LY_ERR;
}
pub type lyplg_ext_sprinter_info_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut lyspr_ctx,
        ext: *mut lysc_ext_instance,
        flag: *mut ly_bool,
    ) -> LY_ERR,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_out {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn lyplg_ext_print_get_out(ctx: *const lyspr_ctx) -> *mut *mut ly_out;
}
unsafe extern "C" {
    pub fn lyplg_ext_print_get_options(ctx: *const lyspr_ctx) -> *mut u32;
}
unsafe extern "C" {
    pub fn lyplg_ext_print_get_level(ctx: *const lyspr_ctx) -> *mut u16;
}
unsafe extern "C" {
    pub fn lyplg_ext_print_info_extension_instance(
        ctx: *mut lyspr_ctx,
        ext: *const lysc_ext_instance,
        flag: *mut ly_bool,
    );
}
pub type lyplg_ext_node_xpath_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ext: *mut lysc_ext_instance,
        cur_node: *const lyd_node,
        node: *mut *const lyd_node,
    ),
>;
pub type lyplg_ext_snode_xpath_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ext: *mut lysc_ext_instance,
        prefix: *const ::std::os::raw::c_char,
        prefix_len: u32,
        format: LY_VALUE_FORMAT,
        prefix_data: *mut ::std::os::raw::c_void,
        name: *const ::std::os::raw::c_char,
        name_len: u32,
        snode: *mut *const lysc_node,
    ) -> LY_ERR,
>;
pub type lyplg_ext_data_snode_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ext: *mut lysc_ext_instance,
        parent: *const lyd_node,
        sparent: *const lysc_node,
        prefix: *const ::std::os::raw::c_char,
        prefix_len: u32,
        format: LY_VALUE_FORMAT,
        prefix_data: *mut ::std::os::raw::c_void,
        name: *const ::std::os::raw::c_char,
        name_len: u32,
        snode: *mut *const lysc_node,
    ) -> LY_ERR,
>;
pub type lyplg_ext_data_validate_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ext: *mut lysc_ext_instance,
        node: *mut lyd_node,
        dep_tree: *const lyd_node,
        data_type: lyd_type,
        val_opts: u32,
        diff: *mut *mut lyd_node,
    ) -> LY_ERR,
>;
pub type lyplg_ext_parse_free_clb =
    ::std::option::Option<unsafe extern "C" fn(ctx: *const ly_ctx, ext: *mut lysp_ext_instance)>;
unsafe extern "C" {
    pub fn lyplg_ext_pfree_instance_substatements(
        ctx: *const ly_ctx,
        substmts: *mut lysp_ext_substmt,
    );
}
pub type lyplg_ext_compile_free_clb =
    ::std::option::Option<unsafe extern "C" fn(ctx: *const ly_ctx, ext: *mut lysc_ext_instance)>;
unsafe extern "C" {
    pub fn lyplg_ext_cfree_instance_substatements(
        ctx: *const ly_ctx,
        substmts: *mut lysc_ext_substmt,
    );
}
pub type lyplg_ext_compiled_size_clb = ::std::option::Option<
    unsafe extern "C" fn(
        ext: *const lysc_ext_instance,
        addr_ht: *mut ly_ht,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn lyplg_ext_compiled_stmts_storage_size(
        substmts: *const lysc_ext_substmt,
        addr_ht: *mut ly_ht,
    ) -> ::std::os::raw::c_int;
}
pub type lyplg_ext_compiled_print_clb = ::std::option::Option<
    unsafe extern "C" fn(
        orig_ext: *const lysc_ext_instance,
        ext: *mut lysc_ext_instance,
        addr_ht: *mut ly_ht,
        ptr_set: *mut ly_set,
        mem: *mut *mut ::std::os::raw::c_void,
    ) -> LY_ERR,
>;
unsafe extern "C" {
    pub fn lyplg_ext_compiled_stmts_storage_print(
        orig_substmts: *const lysc_ext_substmt,
        substmts: *mut lysc_ext_substmt,
        addr_ht: *mut ly_ht,
        ptr_set: *mut ly_set,
        mem: *mut *mut ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_compiled_print_get_addr(
        addr_ht: *const ly_ht,
        addr: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn lyplg_ext_compiled_print_add_addr(
        addr_ht: *mut ly_ht,
        orig_addr: *const ::std::os::raw::c_void,
        addr: *const ::std::os::raw::c_void,
    ) -> LY_ERR;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyplg_ext {
    pub id: *const ::std::os::raw::c_char,
    pub parse: lyplg_ext_parse_clb,
    pub compile: lyplg_ext_compile_clb,
    pub printer_info: lyplg_ext_sprinter_info_clb,
    pub node_xpath: lyplg_ext_node_xpath_clb,
    pub snode_xpath: lyplg_ext_snode_xpath_clb,
    pub snode: lyplg_ext_data_snode_clb,
    pub validate: lyplg_ext_data_validate_clb,
    pub pfree: lyplg_ext_parse_free_clb,
    pub cfree: lyplg_ext_compile_free_clb,
    pub compiled_size: lyplg_ext_compiled_size_clb,
    pub compiled_print: lyplg_ext_compiled_print_clb,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyplg_ext"][::std::mem::size_of::<lyplg_ext>() - 96usize];
    ["Alignment of lyplg_ext"][::std::mem::align_of::<lyplg_ext>() - 8usize];
    ["Offset of field: lyplg_ext::id"][::std::mem::offset_of!(lyplg_ext, id) - 0usize];
    ["Offset of field: lyplg_ext::parse"][::std::mem::offset_of!(lyplg_ext, parse) - 8usize];
    ["Offset of field: lyplg_ext::compile"][::std::mem::offset_of!(lyplg_ext, compile) - 16usize];
    ["Offset of field: lyplg_ext::printer_info"]
        [::std::mem::offset_of!(lyplg_ext, printer_info) - 24usize];
    ["Offset of field: lyplg_ext::node_xpath"]
        [::std::mem::offset_of!(lyplg_ext, node_xpath) - 32usize];
    ["Offset of field: lyplg_ext::snode_xpath"]
        [::std::mem::offset_of!(lyplg_ext, snode_xpath) - 40usize];
    ["Offset of field: lyplg_ext::snode"][::std::mem::offset_of!(lyplg_ext, snode) - 48usize];
    ["Offset of field: lyplg_ext::validate"][::std::mem::offset_of!(lyplg_ext, validate) - 56usize];
    ["Offset of field: lyplg_ext::pfree"][::std::mem::offset_of!(lyplg_ext, pfree) - 64usize];
    ["Offset of field: lyplg_ext::cfree"][::std::mem::offset_of!(lyplg_ext, cfree) - 72usize];
    ["Offset of field: lyplg_ext::compiled_size"]
        [::std::mem::offset_of!(lyplg_ext, compiled_size) - 80usize];
    ["Offset of field: lyplg_ext::compiled_print"]
        [::std::mem::offset_of!(lyplg_ext, compiled_print) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyplg_ext_record {
    pub module: *const ::std::os::raw::c_char,
    pub revision: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub plugin: lyplg_ext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyplg_ext_record"][::std::mem::size_of::<lyplg_ext_record>() - 120usize];
    ["Alignment of lyplg_ext_record"][::std::mem::align_of::<lyplg_ext_record>() - 8usize];
    ["Offset of field: lyplg_ext_record::module"]
        [::std::mem::offset_of!(lyplg_ext_record, module) - 0usize];
    ["Offset of field: lyplg_ext_record::revision"]
        [::std::mem::offset_of!(lyplg_ext_record, revision) - 8usize];
    ["Offset of field: lyplg_ext_record::name"]
        [::std::mem::offset_of!(lyplg_ext_record, name) - 16usize];
    ["Offset of field: lyplg_ext_record::plugin"]
        [::std::mem::offset_of!(lyplg_ext_record, plugin) - 24usize];
};
unsafe extern "C" {
    pub fn lyplg_ext_stmt2str(stmt: ly_stmt) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lyplg_ext_nodetype2stmt(nodetype: u16) -> ly_stmt;
}
unsafe extern "C" {
    pub fn lyplg_ext_get_storage(
        ext: *const lysc_ext_instance,
        stmt: ::std::os::raw::c_int,
        storage_size: u32,
        storage: *mut *const ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_parsed_get_storage(
        ext: *const lysc_ext_instance,
        stmt: ::std::os::raw::c_int,
        storage_size: u32,
        storage: *mut *const ::std::os::raw::c_void,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_get_data(
        ctx: *const ly_ctx,
        ext: *const lysc_ext_instance,
        parent: *const lyd_node,
        ext_data: *mut *mut ::std::os::raw::c_void,
        ext_data_free: *mut ly_bool,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_set_parent_ctx(ctx: *mut ly_ctx, parent_ctx: *const ly_ctx) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_schema_mount_get_parent_ref(
        ext: *const lysc_ext_instance,
        parent: *const lyd_node,
        refs: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_schema_mount_create_context(
        ext: *const lysc_ext_instance,
        parent: *const lyd_node,
        ctx: *mut *mut ly_ctx,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_schema_mount_create_shared_context(
        ext: *mut lysc_ext_instance,
        ext_data: *const lyd_node,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyplg_ext_schema_mount_destroy_shared_contexts(ext: *mut lysc_ext_instance);
}
unsafe extern "C" {
    pub fn lyplg_ext_schema_mount_destroy_inline_contexts(ext: *mut lysc_ext_instance);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lyd_meta {
    pub parent: *mut lyd_node,
    pub next: *mut lyd_meta,
    pub annotation: *mut lysc_ext_instance,
    pub name: *const ::std::os::raw::c_char,
    pub value: lyd_value,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lyd_meta"][::std::mem::size_of::<lyd_meta>() - 72usize];
    ["Alignment of lyd_meta"][::std::mem::align_of::<lyd_meta>() - 8usize];
    ["Offset of field: lyd_meta::parent"][::std::mem::offset_of!(lyd_meta, parent) - 0usize];
    ["Offset of field: lyd_meta::next"][::std::mem::offset_of!(lyd_meta, next) - 8usize];
    ["Offset of field: lyd_meta::annotation"]
        [::std::mem::offset_of!(lyd_meta, annotation) - 16usize];
    ["Offset of field: lyd_meta::name"][::std::mem::offset_of!(lyd_meta, name) - 24usize];
    ["Offset of field: lyd_meta::value"][::std::mem::offset_of!(lyd_meta, value) - 32usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LY_OUT_TYPE {
    LY_OUT_ERROR = -1,
    LY_OUT_FD = 0,
    LY_OUT_FDSTREAM = 1,
    LY_OUT_FILE = 2,
    LY_OUT_FILEPATH = 3,
    LY_OUT_MEMORY = 4,
    LY_OUT_CALLBACK = 5,
}
unsafe extern "C" {
    pub fn ly_out_type(out: *const ly_out) -> LY_OUT_TYPE;
}
unsafe extern "C" {
    pub fn ly_out_reset(out: *mut ly_out) -> LY_ERR;
}
pub type ly_write_clb = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        buf: *const ::std::os::raw::c_void,
        count: usize,
    ) -> isize,
>;
unsafe extern "C" {
    pub fn ly_out_new_clb(
        writeclb: ly_write_clb,
        user_data: *mut ::std::os::raw::c_void,
        out: *mut *mut ly_out,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_out_clb(out: *mut ly_out, writeclb: ly_write_clb) -> ly_write_clb;
}
unsafe extern "C" {
    pub fn ly_out_clb_arg(
        out: *mut ly_out,
        arg: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ly_out_new_fd(fd: ::std::os::raw::c_int, out: *mut *mut ly_out) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_out_fd(out: *mut ly_out, fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ly_out_new_file(f: *mut FILE, out: *mut *mut ly_out) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_out_file(out: *mut ly_out, f: *mut FILE) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ly_out_new_memory(
        strp: *mut *mut ::std::os::raw::c_char,
        size: usize,
        out: *mut *mut ly_out,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_out_memory(
        out: *mut ly_out,
        strp: *mut *mut ::std::os::raw::c_char,
        size: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_out_new_filepath(
        filepath: *const ::std::os::raw::c_char,
        out: *mut *mut ly_out,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_out_filepath(
        out: *mut ly_out,
        filepath: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_print(out: *mut ly_out, format: *const ::std::os::raw::c_char, ...) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_print_flush(out: *mut ly_out);
}
unsafe extern "C" {
    pub fn ly_write(out: *mut ly_out, buf: *const ::std::os::raw::c_char, len: usize) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_out_printed(out: *const ly_out) -> usize;
}
unsafe extern "C" {
    pub fn ly_out_printed_total(out: *const ly_out) -> usize;
}
unsafe extern "C" {
    pub fn ly_out_free(
        out: *mut ly_out,
        clb_arg_destructor: ::std::option::Option<
            unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void),
        >,
        destroy: ly_bool,
    );
}
unsafe extern "C" {
    pub fn lyd_print_all(
        out: *mut ly_out,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_print_tree(
        out: *mut ly_out,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_print_mem(
        strp: *mut *mut ::std::os::raw::c_char,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_print_fd(
        fd: ::std::os::raw::c_int,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_print_file(
        f: *mut FILE,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_print_path(
        path: *const ::std::os::raw::c_char,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_print_clb(
        writeclb: ly_write_clb,
        user_data: *mut ::std::os::raw::c_void,
        root: *const lyd_node,
        format: LYD_FORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lyd_node_should_print(node: *const lyd_node, options: u32) -> ly_bool;
}
unsafe extern "C" {
    pub fn lyd_metadata_should_print(meta: *const lyd_meta) -> ly_bool;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum LYS_OUTFORMAT {
    LYS_OUT_UNKNOWN = 0,
    LYS_OUT_YANG = 1,
    LYS_OUT_YANG_COMPILED = 2,
    LYS_OUT_YIN = 3,
    LYS_OUT_TREE = 4,
}
unsafe extern "C" {
    pub fn lys_print_module(
        out: *mut ly_out,
        module: *const lys_module,
        format: LYS_OUTFORMAT,
        line_length: usize,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_submodule(
        out: *mut ly_out,
        submodule: *const lysp_submodule,
        format: LYS_OUTFORMAT,
        line_length: usize,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_mem(
        strp: *mut *mut ::std::os::raw::c_char,
        module: *const lys_module,
        format: LYS_OUTFORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_fd(
        fd: ::std::os::raw::c_int,
        module: *const lys_module,
        format: LYS_OUTFORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_file(
        f: *mut FILE,
        module: *const lys_module,
        format: LYS_OUTFORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_path(
        path: *const ::std::os::raw::c_char,
        module: *const lys_module,
        format: LYS_OUTFORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_clb(
        writeclb: ly_write_clb,
        user_data: *mut ::std::os::raw::c_void,
        module: *const lys_module,
        format: LYS_OUTFORMAT,
        options: u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn lys_print_node(
        out: *mut ly_out,
        node: *const lysc_node,
        format: LYS_OUTFORMAT,
        line_length: usize,
        options: u32,
    ) -> LY_ERR;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ly_set {
    pub size: u32,
    pub count: u32,
    pub __bindgen_anon_1: ly_set__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ly_set__bindgen_ty_1 {
    pub dnodes: *mut *mut lyd_node,
    pub snodes: *mut *mut lysc_node,
    pub objs: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ly_set__bindgen_ty_1"][::std::mem::size_of::<ly_set__bindgen_ty_1>() - 8usize];
    ["Alignment of ly_set__bindgen_ty_1"][::std::mem::align_of::<ly_set__bindgen_ty_1>() - 8usize];
    ["Offset of field: ly_set__bindgen_ty_1::dnodes"]
        [::std::mem::offset_of!(ly_set__bindgen_ty_1, dnodes) - 0usize];
    ["Offset of field: ly_set__bindgen_ty_1::snodes"]
        [::std::mem::offset_of!(ly_set__bindgen_ty_1, snodes) - 0usize];
    ["Offset of field: ly_set__bindgen_ty_1::objs"]
        [::std::mem::offset_of!(ly_set__bindgen_ty_1, objs) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ly_set"][::std::mem::size_of::<ly_set>() - 16usize];
    ["Alignment of ly_set"][::std::mem::align_of::<ly_set>() - 8usize];
    ["Offset of field: ly_set::size"][::std::mem::offset_of!(ly_set, size) - 0usize];
    ["Offset of field: ly_set::count"][::std::mem::offset_of!(ly_set, count) - 4usize];
};
unsafe extern "C" {
    pub fn ly_set_new(set_p: *mut *mut ly_set) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_set_dup(
        set: *const ly_set,
        duplicator: ::std::option::Option<
            unsafe extern "C" fn(obj: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        newset_p: *mut *mut ly_set,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_set_add(
        set: *mut ly_set,
        object: *const ::std::os::raw::c_void,
        list: ly_bool,
        index_p: *mut u32,
    ) -> LY_ERR;
}
unsafe extern "C" {
    pub fn ly_set_merge(
        trg: *mut ly_set,
        src: *const ly_set,
        list: ly_bool,
        duplicator: ::std::option::Option<
            unsafe extern "C" fn(obj: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
    ) -> LY_ERR;
}
unsafe extern "C" {
